-- phpMyAdmin SQL Dump
-- version 5.2.3
-- https://www.phpmyadmin.net/
--
-- Хост: localhost
-- Время создания: Июл 27 2026 г., 18:11
-- Версия сервера: 8.0.46-0ubuntu0.22.04.3
-- Версия PHP: 7.4.33

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `hex_db`
--

-- --------------------------------------------------------

--
-- Структура таблицы `cache`
--

CREATE TABLE `cache` (
  `key` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `value` mediumtext COLLATE utf8mb4_unicode_ci NOT NULL,
  `expiration` int NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `cache_locks`
--

CREATE TABLE `cache_locks` (
  `key` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `owner` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `expiration` int NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `card_actions`
--

CREATE TABLE `card_actions` (
  `id` bigint UNSIGNED NOT NULL,
  `action` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `points` int NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `card_actions`
--

INSERT INTO `card_actions` (`id`, `action`, `points`, `created_at`, `updated_at`) VALUES
(1, 'Почешите у соседа за правым ухом', 10, '2025-05-22 10:33:50', '2025-05-22 10:33:50'),
(2, 'Поменяйтесь местами внутри команды', 10, '2025-05-22 11:20:40', '2025-05-22 11:20:40'),
(3, 'Всей командой изобразите крабов и ходите так 10 секунд', 10, '2025-05-22 11:20:52', '2025-05-22 11:20:52'),
(4, 'Станцуйте командой как роботы под воображаемую музыку', 10, '2025-05-22 11:21:00', '2025-05-22 11:21:00'),
(5, 'Покажите без слов, что вы – обезьяны', 10, '2025-05-22 11:21:11', '2025-05-22 11:21:11'),
(6, 'Сделайте по 3 комплимента игрокам другой команды. Не повторяйтесь!', 10, '2025-05-22 11:21:19', '2025-05-22 11:21:19'),
(7, 'Пройдите по кругу на корточках, положа руки на плечи впереди идущему соседу', 10, '2025-05-22 11:21:27', '2025-05-22 11:21:27'),
(8, 'С завязанными глазами, на ощупь, угадайте, кто перед вами', 10, '2025-05-22 11:21:35', '2025-05-22 11:21:35'),
(9, 'Попрыгайте командой на одной ноге, держась за руки', 10, '2025-05-22 11:21:41', '2025-05-22 11:21:41'),
(10, 'Выбери человека и скажи ему три прилагательных, которые его описывают', 10, '2025-05-22 11:21:48', '2025-05-22 11:21:48'),
(11, 'Сделайте вид, что вы зеркало – повторяйте движения игроков другой команды 10 секунд', 10, '2025-05-22 11:22:07', '2025-05-22 11:22:07'),
(12, 'Обнимите самого тихого игрока сегодняшней игры', 10, '2025-05-22 11:22:14', '2025-05-22 11:22:14'),
(13, 'Сыграйте в «гляделки» с игроками другой команды', 10, '2025-05-22 11:22:22', '2025-05-22 11:22:22'),
(14, 'Сделайте по 5 приседаний с хлопком над головой', 10, '2025-05-22 11:22:29', '2025-05-22 11:22:29'),
(15, 'Покажите, как бы вы отреагировали на фразу «Сегодня все уроки/пары отменены!!!»', 10, '2025-05-22 11:22:35', '2025-05-22 11:23:21'),
(16, 'Постройтесь командой в линию по алфавиту', 10, '2025-05-22 11:23:11', '2025-05-22 11:23:11'),
(17, 'Создайте живую скульптуру на тему «Счастье»', 10, '2025-05-22 11:33:16', '2025-05-22 11:33:16'),
(18, 'Потанцуйте, как будто вокруг пчелы', 10, '2025-05-22 11:33:22', '2025-05-22 11:33:22'),
(19, 'Встаньте в круг по росту – от высокого к низкому', 10, '2025-05-22 11:33:28', '2025-05-22 11:33:28'),
(20, 'Всей командой изобразите мост, используя только руки', 10, '2025-05-22 11:33:34', '2025-05-22 11:33:34'),
(21, 'Изобразите кота, который выпрашивает у хозяина еду', 10, '2025-05-22 11:33:41', '2025-05-22 11:33:41');

-- --------------------------------------------------------

--
-- Структура таблицы `card_action_specializations`
--

CREATE TABLE `card_action_specializations` (
  `card_action_id` bigint UNSIGNED NOT NULL,
  `specialization_id` bigint UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `card_action_specializations`
--

INSERT INTO `card_action_specializations` (`card_action_id`, `specialization_id`) VALUES
(1, 1),
(2, 1),
(3, 1),
(4, 1),
(5, 1),
(6, 1),
(7, 1),
(8, 1),
(9, 1),
(10, 1),
(11, 1),
(12, 1),
(13, 1),
(14, 1),
(15, 1),
(16, 1),
(17, 1),
(18, 1),
(19, 1),
(20, 1),
(21, 1);

-- --------------------------------------------------------

--
-- Структура таблицы `card_decides`
--

CREATE TABLE `card_decides` (
  `id` bigint UNSIGNED NOT NULL,
  `question` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `answer` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `explanation` text COLLATE utf8mb4_unicode_ci,
  `points` int NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `card_decides`
--

INSERT INTO `card_decides` (`id`, `question`, `answer`, `explanation`, `points`, `created_at`, `updated_at`) VALUES
(1, 'Мастерица связала свитер и продала его за 100 руб. Какую прибыль она получила, если на свитер пошло три мотка шерсти по 20 руб. за моток, а на украшения свитера понадобился бисер стоимостью 10 руб.', '30 рублей', NULL, 40, '2025-05-22 10:36:09', '2025-05-22 12:10:59'),
(2, 'Два бизнесмена поспорили: кто получил больше прибыли. Один выручил от продажи своих товаров 5000 р., а его расходы составили 3000 р. Другой наторговал на 1000р. меньше, и затратил своих денег всего 2000 р. \nКто выиграл спор?', 'Никто', NULL, 40, '2025-05-22 12:11:28', '2025-05-22 12:11:49'),
(3, 'Костюм стоит 110 долларов. Сколько франков надо заплатить за этот костюм, если курс франка по отношению к доллару составляет 5,5? Т.е. 1 доллар=5,5 франков.', '605 франков', NULL, 40, '2025-05-22 12:11:44', '2025-05-22 12:11:44'),
(4, 'Два друга решили заработать. Они купили в киоске 100 газет по 3 руб. за газету и стали продавать их по 5 руб. за штуку. Какой доход получат ребята, когда продадут все газеты?', '200 рублей', NULL, 40, '2025-05-22 12:12:07', '2025-05-22 12:12:07'),
(5, 'Лиса купила у пчел 100 кг меда за 1000 руб., а на рынке стала продавать его по 12 руб. за кг. Какой доход получит лиса, когда продаст весь мед?', '200 рублей', NULL, 40, '2025-05-22 12:12:19', '2025-05-22 12:12:19'),
(6, 'Коля печет пирожки и продает их на рынке. В первый день он продал 100 пирожков по цене 1 руб. за один пирожок. На следующий день он снизил цену на 10% и продал 110 пирожков. В какой день он заработал больше денег?', 'В первый день', NULL, 40, '2025-05-22 12:12:34', '2025-05-22 12:12:34'),
(7, 'Вам необходимо продемонстрировать свои умения работать с числами и решить математический пример:\n\n109987 + 259259 ÷ 11 – 340980 × 10% + 10 – 99468 = ???', '0', NULL, 40, '2025-05-22 12:12:47', '2025-05-22 12:12:47'),
(8, 'Выручка от продажи продукции, выпускаемой неким предприятием, составила 50000руб. При этом было израсходовано:\n- На сырье – 20000 руб.\n- На топливо – 1500 руб.\n- Зарплата – 14500 руб.\n- Кредиты, налоги - 4500 руб.\n\n**Какова прибыль предприятия?**', '9500 рублей', NULL, 40, '2025-05-22 12:13:14', '2025-07-01 11:01:49'),
(9, 'В ваш банк положили 500000 р. под 10% годовых. Какую сумму денег вы сможете отдать обратно через полгода?', '525000 рублей', NULL, 40, '2025-05-22 12:13:33', '2025-05-22 12:13:33'),
(10, 'В ваш банк положили 500000 р. под 10% годовых. Какую сумму денег вы сможете отдать через 5 лет?', '~805255 рублей', NULL, 40, '2025-05-22 12:13:53', '2025-05-22 12:13:53'),
(11, 'Маша получает 500 руб. в неделю на карманные расходы. Она тратит:\nНа обеды в школе: 200 руб.\nНа проезд: 100 руб.\nНа кино: 150 руб.\nСколько денег у нее останется через 2 недели, если она откладывает все, что не потратит?', '100 рублей', '__Решение:__ \n1. 500 – (200+100+15)=50 руб./неделя. \n2. За 2 недели: 50×2=100 руб.', 40, '2025-05-22 12:14:29', '2025-05-22 12:16:30'),
(12, 'Ученики 7 класса организовали ярмарку, где продавали handmade-браслеты. \n- Количество проданных браслетов: 50 штук.  \n- Цена одного браслета: 120 рублей.  \n- Себестоимость материалов на один браслет: 80 рублей.  \n\nКакова общая выручка класса от продажи браслетов и прибыль?', '2000 рублей', '__Решение:__ \n1. Выручка = Количество × Цена = 50 × 120 = 6000 рублей.  \n2. Прибыль = Выручка − (Количество × Себестоимость) = 6000 − (50 × 80) = 6000 − 4000 = 2000 рублей.', 40, '2025-05-22 12:14:57', '2025-05-22 12:16:20'),
(13, 'Ученики 6 класса провели мастер-класс, где продавали наборы для создания новогодних открыток.\n- Количество проданных наборов: 40 штук  \n- Цена одного набора: 200 рублей  \n- Себестоимость материалов на один набор: 120 рублей.  \n- Расходы на рекламу (плакаты и объявления): 800 рублей (фиксированная сумма). \n\n__Вопросы:__\n1. Чему равна выручка от продажи наборов? \n2. Какую прибыль получил класс, если учесть все расходы?', '2400 рублей', '__Решение:__ \n1. Выручка = Количество × Цена = 40 × 200 = 8000 рублей \n2. Общие затраты = (Количество × Себестоимость) + Реклама = (40 × 120) + 800 = 4800 + 800 = 5600 рублей \n   Прибыль = Выручка − Затраты = 8000 − 5600 = 2400 рублей', 40, '2025-05-22 12:16:01', '2025-05-22 12:16:01');

-- --------------------------------------------------------

--
-- Структура таблицы `card_decide_specializations`
--

CREATE TABLE `card_decide_specializations` (
  `card_decide_id` bigint UNSIGNED NOT NULL,
  `specialization_id` bigint UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `card_decide_specializations`
--

INSERT INTO `card_decide_specializations` (`card_decide_id`, `specialization_id`) VALUES
(1, 1),
(2, 1),
(3, 1),
(4, 1),
(5, 1),
(6, 1),
(7, 1),
(8, 1),
(9, 1),
(10, 1),
(11, 1),
(12, 1),
(13, 1);

-- --------------------------------------------------------

--
-- Структура таблицы `card_founds`
--

CREATE TABLE `card_founds` (
  `id` bigint UNSIGNED NOT NULL,
  `question` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `urlQuestion` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `urlAnswer` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `card_founds`
--

INSERT INTO `card_founds` (`id`, `question`, `urlQuestion`, `urlAnswer`, `created_at`, `updated_at`) VALUES
(1, 'Найдите трёх лис среди красных панд', 'cards/questions/EFeeTLnwirtrJpOI7NovU33Q1OAWy11tj2022JVQ.svg', 'cards/answers/6mfmoTkH0YQAd7ieEbbVjSDKI6RkQhXUZMNrmRKU.svg', '2025-05-22 10:58:28', '2025-05-22 15:03:44'),
(2, 'Найдите жирафа', 'cards/questions/XvNen4dCZOinV7T3bfN53SKSeAfsRUufBIfxBKuq.svg', 'cards/answers/qa4tqhB4snUmEpmbCfOi3MAADCHgMY69bnMKz1YR.svg', '2025-05-22 13:13:52', '2025-05-22 15:03:37'),
(3, 'Найди три панды без очков', 'cards/questions/WdCf6X8qgKIJuyjCcR5MYOdR4UNyzot8x79nBsvy.svg', 'cards/answers/uvHX4KgMtGff8GLt57KE1GXVrbYNLzIKTYYdcEfT.svg', '2025-05-22 21:07:49', '2025-05-22 21:07:49'),
(8, 'Найдите четыре гусеницы', 'cards/questions/yBDvyNdZtwUnVRjsdRzyAV0blVN03eSmn0dM53rB.svg', 'cards/answers/QB2yD1pZe9MX7H8v3Bc1mYqkLXtGFU4O9ogbQbxb.svg', '2025-05-22 22:07:25', '2025-05-22 22:07:25'),
(9, 'Найдите три яблока', 'cards/questions/KmZytmG2HnMbWKKZtlS4YQnSrCwtkDVAemYuqFeO.svg', 'cards/answers/MdKN8vsZULxfZ9Rb9Y2cFQUimCPqA5nuEHdL3i3l.svg', '2025-05-22 22:08:49', '2025-05-22 22:08:49'),
(10, 'Найдите одну пустую кружку', 'cards/questions/ECkKPRiuQPXuTnrNfKSDtVSZjn5BhFYI2S1VAUj0.svg', 'cards/answers/KYsDZb4Hn7c9FL3fHJULR4gl7b3kKnRmvtUTgmrj.svg', '2025-05-22 22:10:49', '2025-05-22 22:10:49'),
(11, 'Найдите пингвина с кружкой', 'cards/questions/OFKG8jgzvmBLFw9dFlGdVnkEusDxoyuKrMmMnEtp.svg', 'cards/answers/LkNV5Vukbrr1DjmN2pgykheReqDlnnWZCrWIVMLt.svg', '2025-05-22 22:11:07', '2025-05-22 22:11:07'),
(12, 'Найдите пять безносых снеговиков', 'cards/questions/uovmozKoqYCF23virA7ezJxOX6BpFHQl93NipNUz.svg', 'cards/answers/8w2RBzBTjZiSoLaIU9dsiDT9Y7a8I4SzDYVHN8Cp.svg', '2025-05-22 22:11:34', '2025-05-22 22:11:34'),
(13, 'Найдите панду', 'cards/questions/KbbFGElZivpNqUaESvcHs0gDgxVntnUwkN4ViaIY.svg', 'cards/answers/Fol4vxrSkYsgxOYhvqOv7q4IYEVRfuIVN2eDS5M6.svg', '2025-05-22 22:11:54', '2025-05-22 22:11:54'),
(14, 'Найдите приведение', 'cards/questions/xm0AsDHwm7qedWU6ldyUepX866lp9PV0V151oWaq.svg', 'cards/answers/vNe8lSx4kV1s6gWuQT4z4OqMbZTLYfFVZWEExbFN.svg', '2025-05-22 22:12:18', '2025-05-22 22:12:18'),
(15, 'Найдите котика', 'cards/questions/Y9VNZ2MsvNdNrmmvJl3tdvNejh4yEkeCylEwZewg.svg', 'cards/answers/UGwKs4WzfHMbuK3eHefpAk9FmmsPGVvHcxOaFBHb.svg', '2025-05-22 22:12:35', '2025-05-22 22:12:35'),
(16, 'Найдите лягушку', 'cards/questions/Qp1xSH785MZBWEEJypOJK4Y7xQFxjZFxVRU8l7Bb.svg', 'cards/answers/CKHK8HegITXjShADxasfjywpeht2Dgdrz5gWfrg5.svg', '2025-05-22 22:12:53', '2025-05-22 22:12:53'),
(17, 'Найдите козлика', 'cards/questions/f407YCCd33mo4MvSWGTTStVrGS1ke9emoNbQzeGf.svg', 'cards/answers/gbjdD8vL4RCFfNlg4jWB2B6KW2T15SPqdssLLTZu.svg', '2025-05-22 22:13:14', '2025-05-22 22:13:14'),
(18, 'Найдите собаку', 'cards/questions/L6JYqP6IA5Wj87ta4BwfWhitMKrBgQLqwURUFAcC.svg', 'cards/answers/FYbAgozLi5vep3LSlcCdECLIlGVBLuyFwtdTiFok.svg', '2025-05-22 22:13:29', '2025-05-22 22:13:29'),
(19, 'Найдите голубя', 'cards/questions/fIt07AZC43Y0Q1cQdK1TZPEt8Uep8hV2kWq0Jcku.svg', 'cards/answers/ySrvTG7wEMehCv2aDl8hNgl9pFHBzrdTAIUE0zQV.svg', '2025-05-22 22:13:47', '2025-05-22 22:13:47'),
(20, 'Найдите мышь', 'cards/questions/OCIDFnyrEkB9Sc6QZnSRkTu28Sir8RUejbblnCqH.svg', 'cards/answers/eCJ1yusepTBw3vFZq5pFxxPGGbEfhBHjhLah33GW.svg', '2025-05-22 22:14:05', '2025-05-22 22:14:05');

-- --------------------------------------------------------

--
-- Структура таблицы `card_found_specializations`
--

CREATE TABLE `card_found_specializations` (
  `card_found_id` bigint UNSIGNED NOT NULL,
  `specialization_id` bigint UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `card_found_specializations`
--

INSERT INTO `card_found_specializations` (`card_found_id`, `specialization_id`) VALUES
(1, 1),
(2, 1),
(8, 1),
(9, 1),
(10, 1),
(11, 1),
(12, 1),
(13, 1),
(14, 1),
(15, 1),
(16, 1),
(17, 1),
(18, 1),
(19, 1),
(20, 1);

-- --------------------------------------------------------

--
-- Структура таблицы `card_luckies`
--

CREATE TABLE `card_luckies` (
  `id` bigint UNSIGNED NOT NULL,
  `points` int NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `card_luckies`
--

INSERT INTO `card_luckies` (`id`, `points`, `created_at`, `updated_at`) VALUES
(1, 100, '2025-05-22 11:00:22', '2025-05-22 11:00:22'),
(2, -100, '2025-05-22 11:00:33', '2025-05-22 11:00:33');

-- --------------------------------------------------------

--
-- Структура таблицы `card_lucky_specializations`
--

CREATE TABLE `card_lucky_specializations` (
  `card_lucky_id` bigint UNSIGNED NOT NULL,
  `specialization_id` bigint UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `card_lucky_specializations`
--

INSERT INTO `card_lucky_specializations` (`card_lucky_id`, `specialization_id`) VALUES
(1, 1),
(2, 1);

-- --------------------------------------------------------

--
-- Структура таблицы `card_questions`
--

CREATE TABLE `card_questions` (
  `id` bigint UNSIGNED NOT NULL,
  `question` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `answer` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `explanation` text COLLATE utf8mb4_unicode_ci,
  `points` int NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `card_questions`
--

INSERT INTO `card_questions` (`id`, `question`, `answer`, `explanation`, `points`, `created_at`, `updated_at`) VALUES
(1, 'Иван Петров устраивается на работу в ООО «СтройМастер» на должность мастера-отделочника. По трудовому договору его зарплата делится на две части, одну из которых он будет получать 20-го числа каждого месяца. Как называется эта часть зарплаты?', 'Аванс', '__Аванс__ — это часть зарплаты, а не беспроцентный займ. Аванс не облагается НДФЛ. \nНалог удерживается при выплате основной части зарплаты', 50, '2025-05-22 10:34:46', '2025-05-22 12:04:47'),
(2, 'Как называются деньги в международном обращении?', 'Валюта', NULL, 50, '2025-05-22 11:35:40', '2025-05-22 11:35:40'),
(3, 'Термин «бухгалтер» появился в XV веке. Человеком, который, первым в мире получил звание бухгалтер, стал делопроизводитель Инсбрукской счетной палаты, Христофор Штехер.  А как называлась профессия бухгалтера в древности?', 'Писец или счетовод', NULL, 50, '2025-05-22 11:36:22', '2025-05-22 11:36:22'),
(4, 'В бухгалтерском учете есть два ключевых термина, которые буквально переводятся как «я верю» и «я должен». Что это за термины?', 'Дебет и Кредит', '__Дебет (лат. \"debet\" — «он должен»)__ — в бухгалтерии: __«Мне должны»__ (актив). \n- Пример: компания получает деньги от клиента.\n\n__Кредит (лат. \"credit\" — «он верит»).__ — в бухгалтерии: __«Я должен»__ (обязательство). \n- Пример: компания берёт кредит в банке.', 50, '2025-05-22 11:50:16', '2025-05-22 12:03:56'),
(5, 'Как называется «экономическая порода» собак', 'Такса', '__Такса__ — точно установленная расценка товаров или размер оплаты за тот или иной труд, услуги', 50, '2025-05-22 11:50:43', '2025-05-22 12:04:39'),
(6, 'В текущем месяце Петр ожидал получения зарплаты и процентов по вкладу. Он отложил определенную сумму на оплату коммунальных услуг, на продукты, одежду и абонемент в тренажерный зал. После всех этих трат Петр рассчитал, что останутся деньги еще и на непредвиденные нужды. Что распланировал Петр', 'Бюджет', '__Бюджет__ — план доходов и расходов на определенный период времени', 50, '2025-05-22 11:51:01', '2025-05-22 12:04:32'),
(7, 'Мария решила открыть кофейню. Она вложила 500000 руб. в ремонт помещения, покупку оборудования и обучение бариста. Ежемесячная прибыль поле вычета расходов составляла 70000 руб. Примерно через 7 месяцев Мария окупила вложения и начала получать чистый доход. Как называется такой процесс вложения денег', 'Инвестиция', '__Инвестиция__ — процесс вложения денег в акции, проекты, бизнес или себя, с целью получения прибыли в будущем', 50, '2025-05-22 11:51:30', '2025-05-22 12:04:26'),
(8, 'Как называется установленная стоимость товара или услуги', 'Цена', NULL, 50, '2025-05-22 11:52:24', '2025-05-22 11:52:24'),
(9, 'Как называется организация, которая занимается производством товаров или услуг с целью получения прибыли', 'Фирма', NULL, 50, '2025-05-22 11:52:42', '2025-05-22 11:52:42'),
(10, 'Компания «ЭлектроТех» - производитель бытовой техники (холодильники, стиральные машины). На складе, где хранится бытовая техника, произошло короткое замыкание. Сгорело более 100 холодильников. Ущерб составил 5 млн. руб., к чему руководство компании готово не было. Что необходимо было предпринять, чтобы оградить компанию от риска случайной гибели продукции?', 'Страхование', '__Страхование__ — это «финансовая подушка» для бизнеса, которая помогает пережить непредвиденные потери без катастрофических убытков', 50, '2025-05-22 11:53:19', '2025-05-22 12:04:56'),
(11, 'В начале 2020 года с полок магазинов пропали гречка, антисептики и маски. Люди стояли в очередях или приобретали по завышенным ценам у перекупщиков. Каким экономическим термином называется такая ситуация?', 'Дефицит', '__Дефицит__ — недостаток определенных товаров, услуг или ресурсов на рынке, а желающих купить - много', 50, '2025-05-22 11:53:46', '2025-05-22 12:05:04'),
(12, 'Как называется ситуация, при которой одна компания, не имеющая конкурентов, контролирует весь рынок? Например, РЖД – оператор железных дорог в России', 'Монополия', NULL, 50, '2025-05-22 11:54:07', '2025-05-22 11:54:07'),
(13, 'Экономический показатель, измеряющий эффективность получения финансового результата', 'Рентабельность', NULL, 50, '2025-05-22 11:54:23', '2025-05-22 11:54:23'),
(14, 'Фрагмент сказки братьев Гримм __«Горшочек каши»__.\n__Сюжет:__ девочка пошла в лес за ягодами и встретила там старушку. Та попросила у неё ягод, девочка их дала. Старушка поела ягоды и сказала: «Ты мне ягод дала, а я тебе тоже что-то подарю. Вот тебе горшочек». Горшочек был волшебным: стоило сказать: «Раз, два, три, Горшочек, вари!», как он начинал варить вкусную сладкую кашу, а если сказать: «Раз, два, три, больше не вари!», то горшочек переставал варить…\n__Вопрос:__ каким экономическим термином называется обмен, произведенный между девочкой и старушкой?', 'Бартер', '__Бартер__ — обмен товаров и услуг без использования денег– натуральный обмен', 50, '2025-05-22 11:55:06', '2025-05-22 12:05:10'),
(15, 'Иван всегда покупает сыр местного производства за 250 рублей в магазине у дома. Когда в очередной раз Иван зашел в магазин, он увидел, что за пачку сыра теперь нужно заплатить уже 300 рублей. При этом сам сыр остался прежним: та же фирма, состав, производство того же молочного завода. Выросла только цена.  Как называется такая экономическая ситуация?', 'Инфляция', '__Инфляция__ — это процесс обесценивания денег, при котором цены на товары и услуги растут. Проще говоря, на ту же сумму денег со временем можно купить всё меньше', 50, '2025-05-22 11:55:39', '2025-05-22 12:05:17'),
(16, 'Российская компания “РосТекстиль” закупает ткань для производства одежды из немецкой компании “Deutsches Textilhaus”. Отшивает одежду на собственных фабриках и поставляет готовую продукцию в различные магазины по всей России. Каким экономическим термином называется данная ситуация?', 'Импорт', NULL, 50, '2025-05-22 11:55:52', '2025-05-22 11:55:52'),
(17, 'Российская компания “Сибирский Лес” поставляет пиломатериалы (доску) итальянской компании “Legno Italiano”. Каким экономическим термином называется данная ситуация?', 'Экспорт', NULL, 50, '2025-05-22 11:56:26', '2025-05-22 11:56:26'),
(18, 'Компания «СтройГрад» - строительная фирма, возводившая жилые дома - брала крупные подряды, участвовала в государственных тендерах. Рассчитывая на прибыль от новых объектов, брала кредиты на технику и материалы. Однако, из-за проблем с разрешениями и проверками, задержками оплаты от заказчиков, выросшими процентами по кредитам, стройку заморозили.  Банк подал в суд за неуплату. Активы компании распродали, частично погасили долги. Компания закрылась. Люди остались без работы. Что случилось с компанией?', 'Обанкротилась', '__Банкротство__ — финансовое состояние, при котором человек или организация не могут выплатить свои долги', 50, '2025-05-22 11:56:56', '2025-05-22 12:05:24'),
(19, 'Алексей работает менеджером по продажам в компании. В этом месяце он выполнил план на 150% - привлек 10 новых клиентов вместо запланированных 6 и увеличил выручку отдела. В конце месяца Алексей получил выплату, стимулирующую сотрудников добросовестно выполнять плановые задачи или даже делать что-то сверх плана. \nЧто получил Алексей?', 'Премия', NULL, 50, '2025-05-22 11:57:33', '2025-05-22 11:57:33'),
(20, 'Есть такая пословица «Делить шкуру неубитого медведя». Каким термином можно объяснить ее значение с точки зрения бизнеса?', 'Планирование', NULL, 50, '2025-05-22 11:57:56', '2025-05-22 11:57:56'),
(21, 'В 1949 году американский бизнесмен Фрэнк Макнамара отправился в нью-йоркский ресторан со своими друзьями. Но Фрэнк не смог оплатить свой ужин, так как бумажник забыл в кармане другого пиджака. Это очень сильно его расстроило. Однако, эта ситуация натолкнула его на мысль создать… Как вы думаете, что придумал Фрэнк Макнамара?', 'Кредитные карты', NULL, 50, '2025-05-22 11:58:16', '2025-05-22 11:58:16'),
(22, 'В городе N есть пекарня «Вкусняшка» - успешная, с узнаваемым названием, рецептами и стилем. Господин Х заплатил «хозяину» данной пекарни определенную сумму, чтобы открыть такую же пекарню в другом городе. Взамен получил готовый бизнес-план, проверенных партнеров, рекламу и поддержку, а также возможность обучения. Пекарня стала приносить Господину Х прибыль, часть которой он вынужден платить «хозяину» пекарни. Как называется такой принцип работы?', 'Франшиза', '__Франшиза__ — «аренда» успешной бизнес-модели, право работать под известным брендом за плату', 50, '2025-05-22 11:58:43', '2025-05-22 12:05:32'),
(23, 'Как называется бизнес, принадлежащий одному человеку?', 'ИП, индивидуальный предприниматель', '__ИП__ — индивидуальный предприниматель', 50, '2025-05-22 11:59:21', '2025-05-22 12:05:40'),
(24, 'В м/ф «Чиполлино» Джанни Родари Принц Лимон обязал всех жителей оплачивать пользование воздухом, осадками и прочим, так как доходы государства уменьшились. Как называются такие платежи?', 'Налоги', '__Налоги__ — обязательные платежи граждан и организаций государству', 50, '2025-05-22 11:59:49', '2025-05-22 12:04:16'),
(25, 'Какое слово означает и маркетинговое предложение, и долю в бизнесе?', 'Акции', '__Акции__ —  ценные бумаги, дающие право на долю в компании', 50, '2025-05-22 12:00:46', '2025-05-22 12:03:30'),
(26, 'Как называется борьба между экономическими субъектами за максимально эффективное использование факторов производства, при единых правилах для всех ее участников', 'Конкуренция', NULL, 50, '2025-05-22 12:01:03', '2025-05-22 12:01:03'),
(27, 'Как в прошлом назывались люди, предоставляющие денежные средства в долг под начисление процентов?', 'Ростовщики', NULL, 50, '2025-05-22 12:01:15', '2025-05-22 12:01:15'),
(28, 'Какую тару образуют акции предприятия, принадлежащие одному владельцу/находящиеся в собственности инвестора?', 'Пакет', NULL, 50, '2025-05-22 12:01:30', '2025-05-22 12:01:30'),
(29, 'В к/ф «Служебный роман» сотрудники проводят плановую проверку имущества, пересчитывая и фиксируя мебель, сувениры, канцелярские принадлежности и прочее. Как называется такая проверка?', 'Инвентаризация', '__Инвентаризация__ — способ проверки фактического наличия ценностей, путем пересчета, взвешивания', 50, '2025-05-22 12:01:48', '2025-05-22 12:04:04'),
(30, 'Большинство социологов считают профессию бухгалтер одной из самых опасных и ставят ее в один ряд с такими профессиями как, пожарный, полицейский и летчик. Как вы думаете, с чем это связано?', 'Привлечение преступников', 'С тем, что сфера, в которой вращаются ресурсы и капиталы привлекает огромное количество преступников: \n- грабителей;\n- мошенников;\n- аферистов;', 50, '2025-05-22 12:02:45', '2025-05-22 12:02:45'),
(31, 'Компания “Уютный дом”, занимающаяся производством и продажей мебели, в течение нескольких лет демонстрировала стабильный рост прибыли и привлекала инвестиции. Акционеры решили продать компанию. Потенциальные покупатели, прежде чем инвестировать свои средства, провели независимую проверку финансовой отчетности компании. В результате этой проверки выяснилось, что часть сделок проводилась “мимо кассы”, а неучтенные наличные деньги присваивались руководством; в штате числились сотрудники, которые фактически не работали, а зарплата начислялась и переводилась на подконтрольные директору счета; компания завышала стоимость готовой продукции и материалов на складе, чтобы улучшить показатели баланса, создавались фиктивные счета-фактуры от подставных компаний и т.д..\nКак называется такая проверка?', 'Аудит', '__Аудит__ — это независимая проверка финансовой деятельности компании, чтобы убедиться в ее честности, правильности и надежности', 50, '2025-05-22 12:03:20', '2025-05-22 12:03:20'),
(32, 'В бухгалтерском балансе существует две составляющие: активы и пассивы. Простыми словами «активы» — это то, что работает на нас (приносит пользу, доход или сохраняют ценность). «Пассивы» - то, что тянет деньги из вашего кармана (требуют расходов, не принося дохода). Что из предложенного может быть активом и почему?\nВЕЛОСИПЕД, СМАРТФОН, ЗНАНИЕ АНГЛИЙСКОГО ЯЗЫКА, МОДНАЯ СУМКА.', 'Велосипед, смартфон, знание английского языка, модная сумка', 'ВЕЛОСИПЕД – можно использовать для подработки (доставка еды, курьерские услуги). Помогает экономить на транспорте\nСМАРТФОН – можно использовать для учебы и заработка (создание контента и фриланс)\nЗНАНИЕ АНГЛИЙСКОГО ЯЗЫКА – можно переводить тексты за деньги\nМОДНАЯ СУМКА – если ее продать или использовать для создания стиля (например, в блоге) - актив. Если просто пылится в шкафу – пассив', 50, '2025-05-22 12:07:23', '2025-05-22 12:07:23'),
(33, 'В бухгалтерском балансе существует две составляющие: активы и пассивы. Простыми словами «активы» — это то, что работает на нас (приносит пользу, доход или сохраняют ценность). «Пассивы» - то, что тянет деньги из вашего кармана (требуют расходов, не принося дохода). Что из предложенного может быть активом и почему?\nДОМАШНИЙ ПИТОМЕЦ, ПОКУПКА СЛАДОСТЕЙ, КВАРТИРА, КОЛЛЕКЦИЯ МАРОК/МОНЕТ', 'Домашний питомец, квартира, коллекция марок/монет', 'ДОМАШНИЙ ПИТОМЕЦ – можно вести блог о питомце и зарабатывать на этом\nПОКУПКА СЛАДОСТЕЙ – трата денег, вред здоровью\nКВАРТИРА – если сдавать в аренду – актив, а если просто жить и оплачивать ЖКХ\nКОЛЛЕКЦИЯ МАРОК/МОНЕТ – можно дорого продать, если редкая.', 50, '2025-05-22 12:08:39', '2025-05-22 12:08:39');

-- --------------------------------------------------------

--
-- Структура таблицы `card_question_specializations`
--

CREATE TABLE `card_question_specializations` (
  `card_question_id` bigint UNSIGNED NOT NULL,
  `specialization_id` bigint UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `card_question_specializations`
--

INSERT INTO `card_question_specializations` (`card_question_id`, `specialization_id`) VALUES
(1, 1),
(2, 1),
(3, 1),
(4, 1),
(5, 1),
(6, 1),
(7, 1),
(8, 1),
(9, 1),
(10, 1),
(11, 1),
(12, 1),
(13, 1),
(14, 1),
(15, 1),
(16, 1),
(17, 1),
(18, 1),
(19, 1),
(20, 1),
(21, 1),
(22, 1),
(23, 1),
(24, 1),
(25, 1),
(26, 1),
(27, 1),
(28, 1),
(29, 1),
(30, 1),
(31, 1),
(32, 1),
(33, 1);

-- --------------------------------------------------------

--
-- Структура таблицы `card_t_f_s`
--

CREATE TABLE `card_t_f_s` (
  `id` bigint UNSIGNED NOT NULL,
  `question` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `answer` tinyint(1) NOT NULL,
  `explanation` text COLLATE utf8mb4_unicode_ci,
  `points` int NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `card_t_f_s`
--

INSERT INTO `card_t_f_s` (`id`, `question`, `answer`, `explanation`, `points`, `created_at`, `updated_at`) VALUES
(1, 'Если клиент оплатил товар, но сам товар ему еще не отгружен, это уже считается доходом компании', 0, '__Ложь__, пока это обязательство — аванс', 30, '2025-05-22 10:32:44', '2025-05-22 11:04:43'),
(2, 'Если сотрудник взял деньги в подотчет, но не отчитался, эта сумма считается его доходом', 1, '**Правда**. Если сотрудник взял деньги в подотчет, но не отчитался в установленный срок, эта сумма может быть признана его доходом и облагаться налогом. Отсутствие отчета и документов предполагает, что деньги, скорее всего, были потрачены на личные нужды сотрудника, а не в интересах компании', 30, '2025-05-22 11:04:34', '2025-05-22 11:04:34'),
(3, 'Компания может списать все расходы на представительские мероприятия в налоговом учете', 0, '__Ложь__, есть ограничения по Налоговому кодексу', 30, '2025-05-22 11:06:31', '2025-05-22 11:06:31'),
(4, 'Бухгалтерия занимается только расчетами и не имеет отношения к документам', 0, '__Ложь__, бухгалтер ведет счета, налоги, зарплаты и оформляет документы', 30, '2025-05-22 11:06:56', '2025-05-22 11:06:56'),
(5, 'Если у фирмы много денег в кассе, значит, у нее нет долгов', 0, '__Ложь__, у компании могут быть кредиты и обязательства', 30, '2025-05-22 11:07:19', '2025-05-22 11:07:19'),
(6, 'Деньги в кассе компании — это актив', 1, NULL, 30, '2025-05-22 11:07:57', '2025-05-22 11:07:57'),
(7, 'Списание просроченной дебиторской задолженности уменьшает прибыль компании', 1, NULL, 30, '2025-05-22 11:08:21', '2025-05-22 11:08:21'),
(8, 'Если компания заплатила за товар, но его еще не получила, это актив', 0, '__Ложь__, это аванс поставщику — обязательство перед фирмой', 30, '2025-05-22 11:08:40', '2025-05-22 11:08:40'),
(9, 'Фирма может учитывать личные расходы директора как расходы компании', 0, NULL, 30, '2025-05-22 11:09:02', '2025-05-22 11:09:02'),
(10, 'Все доходы и расходы должны подтверждаться документами', 1, NULL, 30, '2025-05-22 11:09:15', '2025-05-22 11:09:15'),
(11, 'Чем больше доход компании, тем больше у нее прибыль', 0, '__Ложь__, прибыль = доходы – расходы', 30, '2025-05-22 11:12:00', '2025-05-22 11:12:00'),
(12, 'Если сотрудник не получил зарплату вовремя, это не проблема компании', 0, '__Ложь__, задержка зарплаты — это нарушение', 30, '2025-05-22 11:12:24', '2025-05-22 11:12:24'),
(13, 'Если компания купила товар, но не получила чек, она не сможет учесть этот расход', 1, NULL, 30, '2025-05-22 11:12:42', '2025-05-22 11:12:42'),
(14, 'Если компания продает товар дешевле, чем купила, она все равно получает доход', 1, '__Правда__, но это не прибыль, а убыток', 30, '2025-05-22 11:13:04', '2025-05-22 11:13:04'),
(15, 'Если человек получает зарплату «в конверте», он не платит налоги', 1, '__Правда__, но это незаконно', 30, '2025-05-22 11:13:37', '2025-05-22 11:13:37'),
(16, 'Если бизнес не зарабатывает деньги, он не должен сдавать отчеты', 0, '__Ложь__, отчетность обязана быть', 30, '2025-05-22 11:13:54', '2025-05-22 11:13:54'),
(17, 'Клиент заплатил за товар, но не забрал его. Компания может считать деньги своими', 1, '__Правда__, это доход', 30, '2025-05-22 11:14:15', '2025-05-22 11:14:15'),
(18, 'Если фирма ничего не продает, она не может иметь расходов', 0, '__Ложь__, расходы есть всегда: аренда, зарплата, налоги', 30, '2025-05-22 11:14:37', '2025-05-22 11:14:37'),
(19, 'Если поставщик простил долг, считается ли это доходом', 1, NULL, 30, '2025-05-22 11:14:52', '2025-05-22 11:14:52'),
(20, 'Фирма может учитывать расходы на зарплаты сотрудников как свои затраты', 1, NULL, 30, '2025-05-22 11:15:02', '2025-05-22 11:15:02');

-- --------------------------------------------------------

--
-- Структура таблицы `card_t_f_specializations`
--

CREATE TABLE `card_t_f_specializations` (
  `card_t_f_id` bigint UNSIGNED NOT NULL,
  `specialization_id` bigint UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `card_t_f_specializations`
--

INSERT INTO `card_t_f_specializations` (`card_t_f_id`, `specialization_id`) VALUES
(1, 1),
(2, 1),
(3, 1),
(4, 1),
(5, 1),
(6, 1),
(7, 1),
(8, 1),
(9, 1),
(10, 1),
(11, 1),
(12, 1),
(13, 1),
(14, 1),
(15, 1),
(16, 1),
(17, 1),
(18, 1),
(19, 1),
(20, 1);

-- --------------------------------------------------------

--
-- Структура таблицы `card_words`
--

CREATE TABLE `card_words` (
  `id` bigint UNSIGNED NOT NULL,
  `word` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `words` json DEFAULT NULL,
  `explanation` text CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `card_words`
--

INSERT INTO `card_words` (`id`, `word`, `words`, `explanation`, `created_at`, `updated_at`) VALUES
(1, 'МАКРОЭКОНОМИЧЕСКИЙ', '[\"акроним\", \"амикрон\", \"амирис\", \"аммоний\", \"аммос\", \"анкер\", \"мак\", \"меч\", \"нос\", \"сон\", \"сом\", \"мор\", \"ром\", \"сэр\", \"сок\", \"рак\", \"мир\", \"рис\", \"комик\", \"арно\", \"аскер\", \"аэрон\", \"иена\", \"икание\", \"икона\", \"иконка\", \"икорка\", \"икос\", \"икра\", \"иксор\", \"имам\", \"имечко\", \"инкор\", \"иомен\", \"ионий\", \"ирей\", \"ириска\", \"ирмос\", \"искание\", \"искорка\", \"искра\", \"йена\", \"йомен\", \"каин\", \"како\", \"камерон\", \"камин\", \"каноэ\", \"кариес\", \"кармин\", \"карч\", \"каск\", \"каско\", \"кейс\", \"кекс\", \"кенар\", \"кенийка\", \"керн\", \"керосин\", \"кикимора\", \"кикс\", \"кимоно\", \"кинема\", \"кино\", \"киноочерк\", \"киоск\", \"кирка\", \"кисейка\", \"киска\", \"кичка\", \"коечка\", \"койка\", \"койне\", \"кокаин\", \"кокер\", \"кокон\", \"кокос\", \"комар\", \"комикс\", \"комкор\", \"комма\", \"комо\", \"комочек\", \"конка\", \"консоме\", \"коран\", \"коран\", \"корейка\", \"корка\", \"кормач\", \"кормомойка\", \"кормчий\", \"корн\", \"корона\", \"коронка\", \"корс\", \"корсак\", \"корчма\", \"косач\", \"косенка\", \"косичка\", \"космач\", \"кочан\", \"край\", \"крайком\", \"крайн\", \"кран\", \"краск\", \"крем\", \"кремний\", \"крен\", \"крин\", \"кройка\", \"кроки\", \"кромка\", \"кросно\", \"маис\", \"майор\", \"макрокосм\", \"макрос\", \"мание\", \"манко\", \"манси\", \"марокен\", \"марокко\", \"масон\", \"мекк\", \"меконий\", \"мениск\", \"мера\", \"мерин\", \"микрокосм\", \"микром\", \"микрон\", \"миксер\", \"миксина\", \"миманс\", \"мимика\", \"мина\", \"мина\", \"минимакс\", \"минор\", \"минорка\", \"минос\", \"миома\", \"мирика\", \"миро\", \"миска\", \"мичман\", \"моисеич\", \"мойка\", \"мойра\", \"мокание\", \"мокасин\", \"мокор\", \"монако\", \"моном\", \"мономер\", \"морион\", \"мормон\", \"мормонка\", \"морс\", \"мрак\", \"накорм\", \"накос\", \"наос\", \"нарком\", \"наскор\", \"насморк\", \"немка\", \"нерка\", \"неро\", \"номер\", \"нора\", \"норма\", \"носач\", \"носочек\", \"океан\", \"окно\", \"окорка\", \"окорм\", \"окрас\", \"оксиморон\", \"омикрон\", \"омоним\", \"омонимика\", \"онер\", \"оникс\", \"ориноко\", \"ороч\", \"орочон\", \"осек\", \"осечка\", \"оскомина\", \"оскор\", \"осма\", \"осмий\", \"осока\", \"очерк\", \"оческа\", \"очко\", \"район\", \"рамс\", \"ранчо\", \"раск\", \"рейка\", \"рейс\", \"река\", \"рений\", \"рено\", \"реомойка\", \"ресничка\", \"речка\", \"речонка\", \"ринк\", \"риони\", \"риск\", \"романс\", \"роса\", \"росичка\", \"сейм\", \"сейм\", \"секира\", \"семинар\", \"серко\", \"сеча\", \"сечка\", \"сикомор\", \"синема\", \"синичка\", \"сион\", \"сион\", \"сирийка\", \"сирин\", \"сирокко\", \"скан\", \"сканер\", \"скарн\", \"скач\", \"скорм\", \"смак\", \"смена\", \"смерк\", \"смерч\", \"сморкание\", \"сморкач\", \"сойка\", \"сойма\", \"соменка\", \"сомина\", \"сонар\", \"сонм\", \"срам\", \"чайн\", \"черкас\", \"черника\", \"ческа\", \"чикс\", \"чирей\", \"чмокание\", \"экер\", \"эконом\", \"экономика\", \"экономическа\", \"экономка\", \"экран\", \"эман\", \"эмеранс\", \"эмир\", \"эмка\", \"эммер\", \"эрос\", \"эсер\", \"эсерка\", \"эскимо\", \"рок\", \"ор\", \"чек\"]', '*Макроэкономический - относящийся к общим тенденциям и явлениям в экономике страны, а не к отдельным ее частям. Это как смотреть на лес целиком, а не на каждое дерево в отдельности*', '2025-05-22 10:45:30', '2025-05-22 12:32:42'),
(2, 'ИНФРАСТРУКТУРНЫЙ', '[\"аист\", \"актин\", \"акут\", \"акын\", \"анкист\", \"анус\", \"рак\", \"рис\", \"артист\", \"артрит\", \"арфист\", \"арык\", \"атрий\", \"ауксин\", \"икарус\", \"икра\", \"иктус\", \"инсайт\", \"инфаркт\", \"искра\", \"истфак\", \"каин\", \"кайт\", \"кантри\", \"канун\", \"карст\", \"кафр\", \"киста\", \"кнур\", \"кнут\", \"кныр\", \"край\", \"крайн\", \"кран\", \"крат\", \"крин\", \"крыса\", \"ксантин\", \"ктура\", \"курс\", \"курсант\", \"куртина\", \"куст\", \"кутас\", \"найт\", \"нансук\", \"наст\", \"натиск\", \"натр\", \"натрий\", \"нисан\", \"нитка\", \"нитрат\", \"нутка\", \"ракун\", \"ракурс\", \"рант\", \"раск\", \"раскур\", \"раст\", \"ратин\", \"раут\", \"ринк\", \"риск\", \"рифт\", \"рука\", \"русак\", \"русин\", \"руст\", \"рустика\", \"рута\", \"рута\", \"рутина\", \"рысак\", \"рыск\", \"сайт\", \"ситар\", \"скан\", \"скарн\", \"скаут\", \"скит\", \"стан\", \"станнит\", \"старт\", \"стирка\", \"стриктура\", \"струйка\", \"структура\", \"струна\", \"струнка\", \"стык\", \"сунна\", \"суннит\", \"сутра\", \"суфий\", \"сырт\", \"таин\", \"тайфун\", \"такси\", \"такт\", \"такыр\", \"танк\", \"танкист\", \"тариф\", \"таск\", \"таскун\", \"тина\", \"тинктура\", \"тиран\", \"тирс\", \"титр\", \"тиун\", \"трак\", \"тракт\", \"трактир\", \"трас\", \"траст\", \"траур\", \"триас\", \"трифан\", \"трынка\", \"туника\", \"туниска\", \"турист\", \"туристка\", \"турнир\", \"турф\", \"туфта\", \"украйн\", \"укус\", \"униат\", \"уран\", \"уран\", \"уранит\", \"урат\", \"урина\", \"урна\", \"утирка\", \"утруска\", \"факир\", \"факс\", \"факт\", \"фактис\", \"фактурист\", \"фант\", \"фарс\", \"фарси\", \"фарт\", \"фартук\", \"фаунист\", \"фиакр\", \"фиат\", \"фикс\", \"фикус\", \"финт\", \"фирн\", \"фиск\", \"фита\", \"фрак\", \"франт\", \"фрау\", \"фукс\", \"фуксин\", \"фукус\", \"фунт\", \"фура\", \"фурнитура\", \"фуст\", \"футурист\", \"футуристка\", \"фыркун\", \"нут\", \"тур\", \"тик\", \"кит\", \"тир\"]', '*Инфраструктурный - относящийся к базовым системам и сооружениям, необходимым для функционирования экономики и общества. Развитие инфраструктуры является важным фактором экономического роста и повышения качества жизни*', '2025-05-22 12:32:32', '2025-05-22 12:34:14'),
(3, 'КРЕДИТОСПОСОБНОСТЬ', '[\"рок\", \"нос\", \"сон\", \"сок\", \"рис\", \"бедность\", \"бедро\", \"бекон\", \"бентос\", \"беспокоитьс\", \"бесспорн\", \"бест\", \"бетон\", \"бетонит\", \"бидон\", \"бикс\", \"бинт\", \"бионт\", \"биос\", \"биотоп\", \"биотрон\", \"бисер\", \"бистр\", \"бистро\", \"бодрость\", \"бокс\", \"боксит\", \"бонитет\", \"борид\", \"борн\", \"борнит\", \"борт\", \"борть\", \"боскет\", \"босс\", \"бостон\", \"бостон\", \"ботдек\", \"бренд\", \"бренди\", \"брикет\", \"бритт\", \"брод\", \"брос\", \"броскость\", \"дебит\", \"дебитор\", \"дебрь\", \"деист\", \"декор\", \"декорт\", \"декстрин\", \"денс\", \"депо\", \"депорт\", \"дербист\", \"дерть\", \"деспот\", \"десть\", \"детрит\", \"детскость\", \"диен\", \"дикость\", \"диктор\", \"диоптр\", \"диск\", \"дисконт\", \"дисконтер\", \"дискос\", \"диссектор\", \"днеп\", \"добор\", \"докер\", \"доктор\", \"донор\", \"донос\", \"допрос\", \"дорн\", \"досье\", \"дотрет\", \"дрек\", \"дробность\", \"дробь\", \"дроние\", \"дросс\", \"дрот\", \"едкость\", \"ендит\", \"енот\", \"икос\", \"иксор\", \"индекс\", \"инкор\", \"инспектор\", \"интер\", \"ирод\", \"испод\", \"испорт\", \"иссек\", \"иссоп\", \"истод\", \"кбит\", \"кедр\", \"кепи\", \"керн\", \"керосин\", \"кессон\", \"кинд\", \"кино\", \"киносеть\", \"киот\", \"кисет\", \"кистень\", \"кисть\", \"кноп\", \"кодеин\", \"кодон\", \"кондитер\", \"кондор\", \"кондотьер\", \"конто\", \"конь\", \"копие\", \"копир\", \"копоть\", \"копт\", \"копь\", \"кордит\", \"корень\", \"кореопсис\", \"корн\", \"корнетист\", \"корнит\", \"короб\", \"короед\", \"корп\", \"корс\", \"корсет\", \"корт\", \"кортит\", \"корь\", \"косеть\", \"косность\", \"косоротость\", \"кото\", \"котон\", \"кредит\", \"кредо\", \"крен\", \"креодонт\", \"крепост\", \"крепость\", \"крепс\", \"крепь\", \"кресс\", \"крест\", \"кретин\", \"кретон\", \"крин\", \"криптон\", \"кросно\", \"кросс\", \"крот\", \"кротон\", \"кротость\", \"ктитор\", \"небо\", \"небр\", \"небритость\", \"неброскость\", \"недобор\", \"недокись\", \"недоокись\", \"неист\", \"некот\", \"непод\", \"неро\", \"нить\", \"норд\", \"носкость\", \"нотис\", \"нотр\", \"обдир\", \"обед\", \"оберон\", \"обертон\", \"обет\", \"обкос\", \"обнос\", \"обод\", \"оборот\", \"оборотень\", \"оботр\", \"оботрет\", \"оброть\", \"обсе\", \"одеон\", \"одер\", \"одер\", \"одессит\", \"одинокость\", \"однообр\", \"одобр\", \"одонье\", \"окись\", \"окно\", \"окоп\", \"окосье\", \"окот\", \"окрестность\", \"оксид\", \"октет\", \"октод\", \"онер\", \"оникс\", \"опись\", \"опорос\", \"опрос\", \"оптрон\", \"орден\", \"ориноко\", \"ортикон\", \"ортит\", \"ортодокс\", \"ортодонт\", \"ортопед\", \"ортоскоп\", \"осек\", \"осень\", \"осетин\", \"оскор\", \"особист\", \"особость\", \"осоед\", \"осокорь\", \"осот\", \"оссеин\", \"остеит\", \"остит\", \"ость\", \"отбор\", \"отброс\", \"отит\", \"откос\", \"относ\", \"относитьс\", \"оторопь\", \"отоскоп\", \"отпор\", \"отпорно\", \"отрет\", \"отродье\", \"отроек\", \"отсек\", \"отсос\", \"оттер\", \"оттиск\", \"пект\", \"пектин\", \"пенис\", \"пенистость\", \"пенс\", \"пентод\", \"пери\", \"перидот\", \"период\", \"периост\", \"перо\", \"пероксид\", \"перс\", \"перст\", \"персть\", \"песнь\", \"пест\", \"петит\", \"пикет\", \"пикон\", \"пикт\", \"пион\", \"пионер\", \"пирке\", \"пироксен\", \"пирон\", \"пирс\", \"писк\", \"пистон\", \"питон\", \"победность\", \"побор\", \"побр\", \"подкос\", \"поднос\", \"подобие\", \"подобр\", \"подоконье\", \"подотрет\", \"подробнос\", \"подробность\", \"подрост\", \"подсос\", \"подтекст\", \"поед\", \"поиск\", \"покер\", \"покор\", \"покорн\", \"покорность\", \"покороб\", \"покос\", \"пони\", \"понос\", \"понтер\", \"пористость\", \"породность\", \"порск\", \"порт\", \"порто\", \"портье\", \"посессор\", \"посконь\", \"поскор\", \"пособие\", \"поссоритьс\", \"пост\", \"постер\", \"посторонитьс\", \"потесь\", \"потир\", \"потон\", \"потор\", \"потр\", \"потребность\", \"потрет\", \"предис\", \"прекос\", \"прен\", \"пренит\", \"пресность\", \"престон\", \"прие\", \"принос\", \"прио\", \"прис\", \"присед\", \"присест\", \"присестьс\", \"присос\", \"притек\", \"притон\", \"пробст\", \"проект\", \"прокос\", \"проктит\", \"пронос\", \"прос\", \"проседь\", \"просинь\", \"просос\", \"проститьс\", \"протеид\", \"протеин\", \"протест\", \"протон\", \"рдест\", \"редис\", \"редкостность\", \"редкость\", \"рексит\", \"ректон\", \"рено\", \"репс\", \"ресто\", \"ринк\", \"риноскоп\", \"риск\", \"робость\", \"робот\", \"родон\", \"родонит\", \"родопсин\", \"рокот\", \"рондо\", \"ропот\", \"роспись\", \"росс\", \"рост\", \"ротон\", \"сбир\", \"сбитень\", \"сбитость\", \"сбор\", \"сбренд\", \"сбренди\", \"сброд\", \"сброс\", \"сеид\", \"секс\", \"сектор\", \"сенокос\", \"сенсор\", \"сент\", \"сент\", \"сепсис\", \"серб\", \"сердитость\", \"серин\", \"серко\", \"серость\", \"серп\", \"серсо\", \"сеть\", \"сидень\", \"сидр\", \"синерод\", \"синод\", \"сион\", \"сион\", \"сирень\", \"сироп\", \"сирость\", \"систр\", \"сито\", \"ситро\", \"скепсис\", \"скид\", \"скип\", \"скипетр\", \"скит\", \"сконто\", \"скопье\", \"скорбность\", \"скорбь\", \"скородие\", \"скоропись\", \"скорос\", \"скорость\", \"скорпион\", \"скорпион\", \"скос\", \"скрипт\", \"снедь\", \"снип\", \"снитьс\", \"сноб\", \"сноп\", \"снос\", \"собес\", \"собкор\", \"собор\", \"соборность\", \"собр\", \"содер\", \"соед\", \"сонет\", \"сообр\", \"сопор\", \"сопот\", \"сорбент\", \"сорбит\", \"сорность\", \"сорт\", \"сортность\", \"сосед\", \"соскоб\", \"соте\", \"сотерн\", \"сотр\", \"сотрет\", \"спектр\", \"сперт\", \"спертость\", \"спесь\", \"спетость\", \"спикер\", \"спинет\", \"спинор\", \"спирт\", \"спонсор\", \"спорность\", \"спорость\", \"спорт\", \"способ\", \"способнос\", \"способность\", \"спот\", \"спринт\", \"спрос\", \"срост\", \"ссек\", \"ссоритьс\", \"стенд\", \"стендист\", \"стеноп\", \"стенопись\", \"стентор\", \"степс\", \"степь\", \"стер\", \"стерин\", \"стернь\", \"стероид\", \"стетоскоп\", \"стокер\", \"стокс\", \"стокс\", \"стон\", \"стопин\", \"стопор\", \"сторно\", \"стос\", \"стрекот\", \"стресс\", \"строб\", \"стробоскоп\", \"стропт\", \"теин\", \"теист\", \"текс\", \"текст\", \"тенорит\", \"тент\", \"теор\", \"териодонт\", \"терп\", \"терпкость\", \"тесто\", \"тесть\", \"тетрод\", \"тирс\", \"титор\", \"титр\", \"токсин\", \"тонер\", \"тонкос\", \"тонкость\", \"топкость\", \"топор\", \"топорность\", \"топот\", \"топь\", \"тороид\", \"торон\", \"торос\", \"торпедист\", \"торс\", \"торсион\", \"торт\", \"тост\", \"тостер\", \"трек\", \"трен\", \"тренто\", \"треп\", \"треск\", \"трест\", \"трет\", \"треть\", \"трико\", \"трио\", \"триод\", \"триодь\", \"триодь\", \"трип\", \"трипс\", \"тритон\", \"трон\", \"тропот\", \"трос\", \"троскот\", \"трость\", \"трот\", \"ор\", \"тик\", \"кит\", \"тир\", \"тон\", \"ободок\"]', '__Кредитоспособность__ – это ключевой фактор, определяющий возможность получения кредита и условия кредитования. Это оценка надежности заемщика и его способности выполнять свои финансовые обязательства.', '2025-05-22 12:37:27', '2025-05-28 11:30:38'),
(4, 'ГИПЕРИНФЛЯЦИЯ', '[\"герц\", \"гинея\", \"гиря\", \"глиф\", \"глицерин\", \"глицин\", \"глициния\", \"глия\", \"глянец\", \"гнилец\", \"грие\", \"игрец\", \"илие\", \"инерция\", \"инфляция\", \"линия\", \"липец\", \"негр\", \"пери\", \"перл\", \"пиния\", \"пифия\", \"плие\", \"прег\", \"прен\", \"прие\", \"прилег\", \"принц\", \"прицел\", \"регия\", \"религия\", \"реляция\", \"ринг\", \"рицин\", \"фенил\", \"фигляр\", \"фигня\", \"филин\", \"фирн\", \"флец\", \"фригиец\", \"фриц\", \"ил\", \"ляп\", \"пи\", \"ген\"]', 'Гиперинфляция – это ситуация в экономике, при которой цены на товары и услуги растут очень высокими темпами.', '2025-05-22 12:42:16', '2025-05-28 11:42:57'),
(5, 'ИМПОРТОЗАМЕЩЕНИЕ', '[\"амниот\", \"ампер\", \"ампир\", \"анемометр\", \"анизометр\", \"анимизм\", \"антимир\", \"анто\", \"мор\", \"ром\", \"мир\", \"ариозо\", \"арно\", \"атеизм\", \"атом\", \"атомизм\", \"атропин\", \"енот\", \"заин\", \"заинт\", \"заинтер\", \"замещение\", \"замирение\", \"замор\", \"замощение\", \"запор\", \"запрет\", \"запрещение\", \"затмение\", \"затон\", \"затор\", \"защип\", \"земщина\", \"зенит\", \"зенит\", \"зерно\", \"зеро\", \"зима\", \"зона\", \"зонт\", \"зоон\", \"зрение\", \"иена\", \"изатин\", \"измена\", \"измер\", \"измерение\", \"измор\", \"изоатм\", \"изомер\", \"изопрен\", \"изор\", \"изотера\", \"изотерма\", \"изотоп\", \"изощрение\", \"имам\", \"имение\", \"имеретин\", \"импорт\", \"инозит\", \"интер\", \"иомен\", \"ионизатор\", \"ионит\", \"ионометр\", \"иприт\", \"иранизм\", \"мазер\", \"мамонт\", \"мание\", \"манизм\", \"манометр\", \"манто\", \"маринизм\", \"мартини\", \"мартинизм\", \"матер\", \"матине\", \"мезоатом\", \"мезон\", \"мезотерма\", \"мезотрон\", \"мент\", \"ментимер\", \"ментор\", \"мера\", \"мерин\", \"мета\", \"метан\", \"метание\", \"метение\", \"метеор\", \"метеоризм\", \"метина\", \"метоп\", \"метро\", \"метроном\", \"миаз\", \"мизантроп\", \"мизер\", \"мимоза\", \"мина\", \"мина\", \"минарет\", \"миниметр\", \"минор\", \"минорат\", \"миозин\", \"миозит\", \"миома\", \"миро\", \"мирт\", \"митоз\", \"митра\", \"митраизм\", \"момент\", \"монета\", \"монизм\", \"монитор\", \"моном\", \"мономер\", \"монотеизм\", \"монотип\", \"монтер\", \"морение\", \"морион\", \"мормон\", \"морозище\", \"морщина\", \"мотание\", \"мотор\", \"моща\", \"мощение\", \"мщение\", \"наитие\", \"наотр\", \"наперт\", \"напор\", \"нарез\", \"натр\", \"нащеп\", \"непотизм\", \"неприз\", \"неро\", \"нерпа\", \"нетерп\", \"нитроза\", \"номер\", \"нора\", \"норма\", \"нота\", \"нотр\", \"озарение\", \"озерно\", \"озеро\", \"озон\", \"омерзение\", \"омметр\", \"омоним\", \"онер\", \"онтарио\", \"опера\", \"оперение\", \"опрощение\", \"оптимизм\", \"оптрон\", \"орнитоз\", \"отирание\", \"отмена\", \"отмирание\", \"отмщение\", \"отомщение\", \"отпирание\", \"отпор\", \"отрез\", \"отрезание\", \"отрепан\", \"отщеп\", \"пани\", \"пантеизм\", \"парез\", \"парение\", \"парнище\", \"пароним\", \"паронит\", \"партие\", \"патер\", \"патио\", \"патон\", \"патроним\", \"пеан\", \"пезета\", \"пемза\", \"пена\", \"пение\", \"перемена\", \"перемет\", \"пери\", \"перина\", \"перо\", \"пещера\", \"пиан\", \"пианизм\", \"пиар\", \"пиетизм\", \"пиит\", \"пимент\", \"пинта\", \"пион\", \"пионер\", \"пиразин\", \"пират\", \"пирит\", \"пирон\", \"питание\", \"питие\", \"питон\", \"пнище\", \"поение\", \"поза\", \"позер\", \"позитрон\", \"позор\", \"позорище\", \"помета\", \"помещение\", \"помин\", \"помор\", \"поморщина\", \"пони\", \"понтер\", \"поощрение\", \"порез\", \"пороз\", \"порт\", \"портмоне\", \"порто\", \"потение\", \"потерна\", \"потир\", \"потирание\", \"потон\", \"потор\", \"потр\", \"празем\", \"пращ\", \"преанимизм\", \"презент\", \"прен\", \"прение\", \"пренит\", \"прие\", \"прием\", \"приз\", \"призма\", \"примета\", \"примит\", \"прио\", \"притон\", \"проза\", \"промен\", \"промзона\", \"промин\", \"промоина\", \"протамин\", \"протез\", \"протеин\", \"протон\", \"протонема\", \"прощание\", \"прощение\", \"птоз\", \"размен\", \"размещение\", \"рант\", \"ратин\", \"ращение\", \"резание\", \"резина\", \"резинат\", \"резинит\", \"резит\", \"резон\", \"ремез\", \"ремонт\", \"рено\", \"реноме\", \"рента\", \"реотан\", \"репа\", \"репет\", \"ретина\", \"риза\", \"риони\", \"ритм\", \"роение\", \"розеин\", \"романизм\", \"романтизм\", \"ропот\", \"роптание\", \"рота\", \"ротище\", \"ротон\", \"роща\", \"ртище\", \"таин\", \"тампон\", \"тапир\", \"теизм\", \"теин\", \"тема\", \"темп\", \"темпера\", \"тензор\", \"теор\", \"теорема\", \"терем\", \"терза\", \"терзание\", \"термин\", \"терминизм\", \"терние\", \"терп\", \"терпен\", \"терпение\", \"тиамин\", \"тимин\", \"тимин\", \"тимпан\", \"тина\", \"тиран\", \"тирозин\", \"тмин\", \"томище\", \"тонарм\", \"тонема\", \"тонер\", \"топаз\", \"топоним\", \"топор\", \"торизм\", \"тормоз\", \"торон\", \"трап\", \"трема\", \"трен\", \"трение\", \"треп\", \"трепан\", \"трепание\", \"трепонема\", \"трещание\", \"трещина\", \"тризм\", \"тризна\", \"трином\", \"трио\", \"трип\", \"троение\", \"тромп\", \"трон\", \"тропизм\", \"трощение\", \"тщание\", \"щепа\", \"щепет\", \"щетина\", \"ор\", \"тир\", \"тон\", \"пи\", \"раз\", \"низ\", \"пир\"]', '*Импортозамещение — это замена на внутреннем рынке страны товаров иностранного производства собственными отечественными аналогами.*', '2025-05-22 12:51:32', '2025-05-22 12:55:16'),
(6, 'БАНКРОТСТВО', '[\"аборт\", \"авто\", \"автор\", \"рок\", \"анто\", \"нос\", \"сон\", \"сок\", \"рак\", \"арно\", \"артос\", \"бакс\", \"банк\", \"банкрот\", \"бант\", \"барк\", \"барн\", \"барон\", \"баронство\", \"барс\", \"барство\", \"баск\", \"басон\", \"бастр\", \"батокс\", \"батон\", \"батор\", \"бокс\", \"борат\", \"борн\", \"борона\", \"борт\", \"бортовка\", \"бостон\", \"бостон\", \"брак\", \"брас\", \"брат\", \"братство\", \"бровка\", \"брокат\", \"брос\", \"ватт\", \"внаброс\", \"внос\", \"вноска\", \"вона\", \"вообр\", \"воронка\", \"ворс\", \"воск\", \"вотр\", \"вскор\", \"втора\", \"второс\", \"карбон\", \"карст\", \"картон\", \"кастор\", \"кастор\", \"катор\", \"квант\", \"квантор\", \"квас\", \"квота\", \"ковар\", \"конто\", \"контора\", \"контра\", \"контраст\", \"коран\", \"коран\", \"корн\", \"короб\", \"корова\", \"корона\", \"короста\", \"корс\", \"корт\", \"кото\", \"котон\", \"краб\", \"кран\", \"крат\", \"кров\", \"кросно\", \"крот\", \"кротон\", \"набор\", \"набр\", \"наброс\", \"накос\", \"наос\", \"наотр\", \"нарост\", \"наскор\", \"наст\", \"натр\", \"новатор\", \"нора\", \"норов\", \"нота\", \"нотка\", \"нотр\", \"нрав\", \"обвор\", \"обкат\", \"обкос\", \"обнова\", \"обновка\", \"обнос\", \"обора\", \"оборка\", \"оботр\", \"обрат\", \"окат\", \"окно\", \"окот\", \"окрас\", \"октан\", \"октант\", \"оскор\", \"основа\", \"особа\", \"осока\", \"осот\", \"останов\", \"остат\", \"остров\", \"острота\", \"отбор\", \"отборка\", \"отброс\", \"отброска\", \"отвар\", \"отвор\", \"отврат\", \"откат\", \"откос\", \"относ\", \"относка\", \"рабство\", \"рант\", \"раск\", \"раст\", \"рват\", \"рвота\", \"роба\", \"робот\", \"рокот\", \"роса\", \"рост\", \"рота\", \"ротон\", \"сабо\", \"сбор\", \"сборка\", \"сван\", \"сват\", \"свора\", \"сворка\", \"сворот\", \"скан\", \"скарб\", \"скарн\", \"скоба\", \"сков\", \"сковор\", \"сконто\", \"сноб\", \"сновка\", \"сноровка\", \"соавтор\", \"собкор\", \"собор\", \"собр\", \"собрат\", \"сова\", \"соковар\", \"сонар\", \"сообр\", \"сорт\", \"сотвор\", \"сотка\", \"сотр\", \"ставр\", \"ставро\", \"стан\", \"старт\", \"статор\", \"створ\", \"створка\", \"стон\", \"сторно\", \"сторновка\", \"сторона\", \"сторонка\", \"стратон\", \"строб\", \"строка\", \"табор\", \"тавот\", \"тавро\", \"таксон\", \"такт\", \"танк\", \"танто\", \"таск\", \"твор\", \"товар\", \"тонкос\", \"торакс\", \"торба\", \"торбан\", \"торбас\", \"торон\", \"торос\", \"торс\", \"торт\", \"тост\", \"травокос\", \"трак\", \"тракт\", \"трас\", \"траст\", \"трон\", \"трос\", \"троскот\", \"тростка\", \"трот\", \"ор\", \"тон\", \"рот\", \"сор\", \"ток\"]', '*Банкротство— это финансовое состояние, при котором человек или организация не могут выплатить свои долги.*', '2025-05-22 12:53:34', '2025-05-22 12:53:34'),
(7, 'ТРАНСНАЦИОНАЛЬНЫЙ', '[\"айлант\", \"айран\", \"айрол\", \"айсор\", \"аланин\", \"алость\", \"алтарь\", \"алтынница\", \"аналой\", \"ананас\", \"анион\", \"анналист\", \"аннона\", \"анонс\", \"анто\", \"аорист\", \"аорта\", \"арат\", \"нос\", \"сон\", \"рис\", \"аристон\", \"арно\", \"арталин\", \"артос\", \"астралин\", \"асцит\", \"атлас\", \"атрий\", \"илот\", \"инсайт\", \"интальо\", \"ланита\", \"лантан\", \"ларь\", \"ласа\", \"ласина\", \"ласт\", \"латынь\", \"лиана\", \"лира\", \"лира\", \"лист\", \"литр\", \"лори\", \"лось\", \"лысина\", \"найт\", \"налой\", \"нанос\", \"наос\", \"наотр\", \"нарост\", \"нарта\", \"наст\", \"настил\", \"настыль\", \"натр\", \"натрий\", \"натрон\", \"наци\", \"национал\", \"нацист\", \"нилот\", \"нисан\", \"нитон\", \"нитрон\", \"нить\", \"нница\", \"ноль\", \"нона\", \"нора\", \"носарь\", \"нота\", \"нотис\", \"нотница\", \"нотр\", \"онанист\", \"оратай\", \"орлан\", \"орлица\", \"осанна\", \"ослица\", \"осталь\", \"остраница\", \"острица\", \"ость\", \"отрасль\", \"раина\", \"район\", \"рало\", \"рана\", \"рант\", \"раса\", \"раст\", \"ратай\", \"ратин\", \"рать\", \"рацион\", \"риал\", \"ройница\", \"роса\", \"росинант\", \"рост\", \"рота\", \"сайра\", \"сайт\", \"салат\", \"салатница\", \"сало\", \"салон\", \"сальто\", \"санаторий\", \"санитар\", \"сантал\", \"сантолина\", \"сантонин\", \"сарай\", \"саран\", \"сарацин\", \"сарынь\", \"силан\", \"сило\", \"силон\", \"силь\", \"сион\", \"сион\", \"сирота\", \"ситар\", \"сито\", \"ситро\", \"слой\", \"слон\", \"слонина\", \"слот\", \"сныть\", \"соланин\", \"сонант\", \"сонар\", \"соната\", \"сонатина\", \"соратница\", \"сорт\", \"сотр\", \"сталь\", \"стан\", \"станина\", \"станиоль\", \"станица\", \"старц\", \"стационар\", \"стило\", \"стиль\", \"стирол\", \"стироль\", \"стлань\", \"стол\", \"столица\", \"стон\", \"страна\", \"страница\", \"странница\", \"стронций\", \"сырт\", \"сырть\", \"сырь\", \"сыть\", \"таин\", \"талан\", \"талина\", \"талион\", \"талон\", \"таль\", \"танцор\", \"тара\", \"тиара\", \"тина\", \"тиноль\", \"тиран\", \"тирс\", \"торий\", \"торица\", \"торс\", \"трал\", \"трас\", \"триас\", \"трилон\", \"трио\", \"триоль\", \"троица\", \"троица\", \"трон\", \"трос\", \"тырло\", \"царь\", \"цата\", \"циан\", \"цианат\", \"циста\", \"цитра\", \"цитраль\", \"цитрон\", \"ор\", \"ил\", \"тир\", \"тон\", \"рот\", \"сор\", \"лот\", \"ион\", \"транс\", \"оса\"]', '*Транснациональный - выходящий за пределы нации, страны, связанный с деятельностью региональных или международных организаций.*', '2025-05-22 12:55:06', '2025-05-22 12:55:06'),
(8, 'АМОРТИЗАЦИЯ', '[\"азарт\", \"азиат\", \"азот\", \"амитоз\", \"амия\", \"аорта\", \"арат\", \"мор\", \"ром\", \"мир\", \"аритмия\", \"армия\", \"аромат\", \"атом\", \"атомизация\", \"замор\", \"заря\", \"затор\", \"заяц\", \"зима\", \"зоря\", \"зоря\", \"измор\", \"изоатм\", \"изор\", \"иматра\", \"мара\", \"марция\", \"матица\", \"матрац\", \"матрица\", \"маца\", \"миаз\", \"миозит\", \"миро\", \"мирт\", \"митоз\", \"митра\", \"рация\", \"риза\", \"ритм\", \"рота\", \"ротацизм\", \"ротация\", \"тара\", \"тиара\", \"торизм\", \"торица\", \"тризм\", \"трио\", \"троица\", \"троица\", \"царизм\", \"цата\", \"цитра\", \"цоизит\", \"ярица\", \"ярмо\", \"ярозит\", \"ор\", \"тир\", \"раз\", \"рот\", \"том\", \"яр\", \"ам\", \"таз\", \"яма\"]', '*Амортизация — это процесс постепенного списания стоимости основных средств (оборудование, здания, техника) или нематериальных активов (патенты, лицензии) в течение срока их полезного использования.  Она помогает компаниям равномерно распределять затраты на их приобретение. Например: закуплено оборудование за 1 млн руб. на 10 лет, его стоимость делится на 10 лет (по 100 тыс. руб. в год), а не списывается сразу.*', '2025-05-22 12:57:01', '2025-05-22 12:57:01'),
(9, 'НЕМАТЕРИАЛЬНАЯ', '[\"аланин\", \"алеман\", \"алтарь\", \"аманат\", \"амарант\", \"аматер\", \"амелия\", \"амиант\", \"амилен\", \"амия\", \"анемия\", \"аннамит\", \"аралия\", \"арат\", \"мир\", \"ареал\", \"армата\", \"армия\", \"армянин\", \"арталин\", \"артель\", \"атаман\", \"ателье\", \"енерал\", \"ерал\", \"иена\", \"ильм\", \"иматра\", \"интер\", \"ительмен\", \"ламантин\", \"ланита\", \"лантан\", \"ларь\", \"латание\", \"лаяние\", \"леер\", \"лента\", \"летание\", \"лиана\", \"лиман\", \"линтер\", \"лира\", \"лира\", \"литр\", \"малень\", \"мали\", \"мали\", \"маляр\", \"манат\", \"манатья\", \"мание\", \"мантиль\", \"мантилья\", \"мантия\", \"мара\", \"марание\", \"маранта\", \"маратель\", \"марель\", \"марена\", \"марля\", \"марь\", \"матер\", \"материал\", \"материя\", \"матерь\", \"матерьял\", \"матине\", \"мать\", \"маянье\", \"меланин\", \"меланин\", \"мель\", \"мент\", \"мера\", \"мерея\", \"мерин\", \"мерлан\", \"мертель\", \"мета\", \"метан\", \"метание\", \"метель\", \"метилен\", \"метина\", \"метла\", \"миля\", \"мина\", \"мина\", \"минарет\", \"минерал\", \"минея\", \"мирт\", \"митра\", \"млат\", \"мление\", \"мленье\", \"мнение\", \"мнитель\", \"налим\", \"наметан\", \"намин\", \"наниматель\", \"нарта\", \"натр\", \"наян\", \"нельма\", \"нения\", \"нерал\", \"нетель\", \"нить\", \"раина\", \"рамень\", \"раменье\", \"рана\", \"ранение\", \"рант\", \"рантье\", \"ратания\", \"ратин\", \"ратман\", \"рать\", \"реал\", \"реалия\", \"реле\", \"релит\", \"рель\", \"ремень\", \"ренин\", \"рента\", \"ренье\", \"ренье\", \"ретина\", \"ретиналь\", \"ретинен\", \"реяние\", \"риал\", \"ритм\", \"таин\", \"талан\", \"талер\", \"талие\", \"талина\", \"талия\", \"таль\", \"тальма\", \"талья\", \"тара\", \"таяние\", \"теин\", \"тема\", \"темень\", \"темь\", \"теньер\", \"терем\", \"теренин\", \"терилен\", \"термин\", \"терминал\", \"терние\", \"тиара\", \"тимьян\", \"тина\", \"тиран\", \"тлен\", \"тление\", \"тмин\", \"трал\", \"траление\", \"трема\", \"трен\", \"трение\", \"тьма\", \"ямина\", \"янтарь\", \"ил\", \"тир\", \"яр\", \"яма\", \"янь\", \"инь\"]', '*В бухгалтерии «нематериальная» относится к нематериальным активам (НМА), которые представляют собой не форму физической формы активов, а приносящие компании экономическую выгоду в будущем. К ним относятся патенты, товарные знаки, авторские права, программное обеспечение, деловая репутация и другие аналогичные объекты.*', '2025-05-22 13:00:58', '2025-05-22 13:00:58'),
(10, 'ЦЕНООБРАЗОВАНИЕ', '[\"абаз\", \"абазин\", \"абазинец\", \"абзац\", \"абразив\", \"авар\", \"аварец\", \"авизо\", \"авран\", \"анабиоз\", \"аневрин\", \"анзерин\", \"анион\", \"араб\", \"арба\", \"ариец\", \"аризонец\", \"ариозо\", \"арно\", \"ароновна\", \"баварец\", \"базар\", \"банан\", \"баннер\", \"баранец\", \"барин\", \"барион\", \"барн\", \"барон\", \"безе\", \"бензин\", \"бензоин\", \"бенинец\", \"березовица\", \"бернец\", \"берц\", \"берцо\", \"бизон\", \"биоценоз\", \"боец\", \"бозон\", \"бонза\", \"боразон\", \"борение\", \"борн\", \"борона\", \"борц\", \"бревно\", \"бриз\", \"бронза\", \"ваза\", \"вазон\", \"варан\", \"варенец\", \"варение\", \"варненец\", \"варница\", \"веер\", \"веерница\", \"вено\", \"верба\", \"вербена\", \"вереница\", \"веронец\", \"взор\", \"виза\", \"вино\", \"вира\", \"вица\", \"возница\", \"воин\", \"вона\", \"вообр\", \"вообраз\", \"воронение\", \"воцарение\", \"врио\", \"евина\", \"евразиец\", \"забвение\", \"забоина\", \"забор\", \"забр\", \"заин\", \"заирец\", \"зарево\", \"зарница\", \"звание\", \"звено\", \"зверинец\", \"звон\", \"звонец\", \"звонница\", \"зебра\", \"зевание\", \"зеница\", \"зернина\", \"зерно\", \"зеро\", \"знание\", \"зона\", \"зоон\", \"зрение\", \"иена\", \"изба\", \"избр\", \"изобара\", \"изобр\", \"изор\", \"инвар\", \"иноверец\", \"иранец\", \"набор\", \"набр\", \"навар\", \"навоз\", \"навозница\", \"название\", \"нанаец\", \"нарез\", \"нарзан\", \"нарцеин\", \"наци\", \"небо\", \"небр\", \"невоз\", \"невроз\", \"ненец\", \"неон\", \"нерв\", \"нервоз\", \"неро\", \"нивоз\", \"нирвана\", \"нница\", \"новина\", \"новобранец\", \"нона\", \"нора\", \"норов\", \"нрав\", \"обвоз\", \"обвор\", \"оберон\", \"обзор\", \"обнинец\", \"обнова\", \"обоз\", \"обозрение\", \"обора\", \"оборванец\", \"оборина\", \"оборона\", \"оборонец\", \"образ\", \"образец\", \"образование\", \"обрез\", \"обрезание\", \"овен\", \"овен\", \"овин\", \"овца\", \"озарение\", \"озерец\", \"озерно\", \"озеро\", \"озерцо\", \"озноб\", \"озон\", \"озорница\", \"онер\", \"орава\", \"равнение\", \"равнина\", \"разница\", \"раина\", \"рана\", \"ранение\", \"ранец\", \"рацион\", \"рванина\", \"рвение\", \"резание\", \"резец\", \"резина\", \"резон\", \"ренин\", \"рено\", \"реобаза\", \"рибоза\", \"риза\", \"роба\", \"ровенец\", \"ровница\", \"роение\", \"розеин\", \"розница\", \"царевна\", \"цена\", \"ценз\", \"цензор\", \"ценоз\", \"церезин\", \"циан\", \"цианоз\", \"ор\", \"раз\", \"низ\", \"ион\", \"ара\", \"бра\"]', '*Ценообразование – это важный процесс для любого бизнеса, который позволяет определить оптимальную цену на товар или услугу, найти различные факторы и стратегии, для достижения поставленных целей.*', '2025-05-22 13:02:47', '2025-05-22 13:02:47'),
(11, 'ВНЕОБОРОТНАЯ', '[\"абонент\", \"аборт\", \"авто\", \"автор\", \"анто\", \"арно\", \"баннер\", \"бант\", \"барн\", \"барон\", \"баронет\", \"батон\", \"батор\", \"батя\", \"бетон\", \"бонтон\", \"борат\", \"борн\", \"борона\", \"борт\", \"брат\", \"бревно\", \"ватер\", \"вено\", \"верба\", \"вето\", \"ветр\", \"вона\", \"вообр\", \"вотр\", \"врет\", \"втора\", \"енот\", \"набор\", \"набр\", \"навет\", \"наврет\", \"наотр\", \"натр\", \"натрон\", \"наян\", \"небо\", \"небр\", \"неон\", \"нерв\", \"неро\", \"неровня\", \"новатор\", \"нона\", \"нонет\", \"нора\", \"норов\", \"нота\", \"нотр\", \"нрав\", \"обвор\", \"оберон\", \"обертон\", \"обет\", \"обнова\", \"обора\", \"оборона\", \"оборот\", \"оботр\", \"обрат\", \"овен\", \"овен\", \"онер\", \"отбор\", \"отвар\", \"отвор\", \"рант\", \"рват\", \"рвота\", \"рено\", \"рента\", \"реотан\", \"роба\", \"робот\", \"ровня\", \"рота\", \"ротон\", \"табор\", \"тавро\", \"твор\", \"теор\", \"теорба\", \"товар\", \"тонер\", \"торба\", \"торбан\", \"торон\", \"треба\", \"трен\", \"трон\", \"явор\", \"яновна\", \"ор\", \"тон\", \"рот\", \"яр\", \"бра\", \"ров\", \"бор\", \"вор\", \"тонна\", \"вена\"]', '*Внеоборотные активы — разновидность имущества предприятия, приносящее доходы в течение более одного года, или обычного операционного цикла, если он превышает один год. Например, здания в собственности, техника и оборудование, долгосрочные вклады, акции и доли в других компаниях.*', '2025-05-22 13:06:49', '2025-05-22 13:06:49'),
(12, 'ИНВЕНТАРИЗАЦИЯ', '[\"авар\", \"аварец\", \"авария\", \"авран\", \"азарт\", \"азиат\", \"аневрин\", \"анзерин\", \"антрацен\", \"аравитянин\", \"арат\", \"арианин\", \"ариец\", \"атеизация\", \"ваза\", \"ванта\", \"варан\", \"вариация\", \"варница\", \"вата\", \"ватер\", \"ватин\", \"ваяние\", \"ветр\", \"взятие\", \"виза\", \"византиец\", \"визир\", \"визит\", \"визитация\", \"винт\", \"винтер\", \"вира\", \"вирт\", \"витание\", \"вития\", \"витрина\", \"вица\", \"врет\", \"втирание\", \"вязание\", \"евина\", \"завет\", \"завт\", \"заин\", \"заинт\", \"заинтер\", \"заирец\", \"занятие\", \"зарница\", \"заря\", \"заряница\", \"затея\", \"заяц\", \"звание\", \"зенит\", \"зенит\", \"зеница\", \"зернина\", \"зияние\", \"знание\", \"ивина\", \"иена\", \"изатин\", \"изваяние\", \"извет\", \"инвазия\", \"инвар\", \"инвариант\", \"инвенция\", \"инвертин\", \"инерция\", \"иннервация\", \"интенция\", \"интер\", \"интинец\", \"иранец\", \"иризация\", \"итерация\", \"навар\", \"навет\", \"наврет\", \"название\", \"наитие\", \"нанаец\", \"нарез\", \"нарзан\", \"нарта\", \"нарцеин\", \"натирание\", \"натр\", \"наци\", \"нация\", \"наян\", \"невнятица\", \"неврит\", \"нения\", \"нерв\", \"нервация\", \"низание\", \"низина\", \"нирвана\", \"нитрация\", \"нница\", \"нрав\", \"равнина\", \"развитие\", \"разиня\", \"разница\", \"раина\", \"рана\", \"ранец\", \"рант\", \"ратания\", \"ратин\", \"рацея\", \"рация\", \"рванина\", \"рват\", \"ревизия\", \"резина\", \"резинат\", \"резинит\", \"резит\", \"резня\", \"ренин\", \"рента\", \"ретина\", \"риза\", \"ризница\", \"рицин\", \"рицинин\", \"рязанец\", \"таверна\", \"таин\", \"танец\", \"танзаниец\", \"тара\", \"таяние\", \"твин\", \"тезаврация\", \"теин\", \"терза\", \"терц\", \"терцина\", \"терция\", \"тиара\", \"тина\", \"тиран\", \"тирания\", \"трава\", \"травина\", \"травница\", \"транец\", \"трен\", \"тризна\", \"царевна\", \"цата\", \"цена\", \"ценз\", \"цент\", \"центавр\", \"центр\", \"циан\", \"цианат\", \"цианин\", \"цинния\", \"цитра\", \"цитрин\", \"яванец\", \"язвенница\", \"язвина\", \"ярица\", \"тир\", \"раз\", \"низ\", \"яр\", \"таз\", \"ара\", \"вена\"]', '*Инвентаризация - это перечёт объектов, которые числятся на балансе организации, и их сверка с учётными документами. Учитывают всё имущество и финансы, в том числе кредиты, займы, задолженности...*', '2025-05-22 13:07:40', '2025-05-22 13:07:40'),
(13, 'КРАТКОСРОЧНЫЕ', '[\"актер\", \"акын\", \"рок\", \"анкер\", \"анто\", \"нос\", \"сон\", \"сок\", \"рак\", \"арест\", \"аресто\", \"арно\", \"артос\", \"арык\", \"аскер\", \"аскет\", \"енот\", \"како\", \"карст\", \"картер\", \"картер\", \"картон\", \"карч\", \"каск\", \"каско\", \"кастор\", \"кастор\", \"катер\", \"катор\", \"катрен\", \"кекс\", \"кенар\", \"керн\", \"кета\", \"кнастер\", \"кныр\", \"коечка\", \"кокер\", \"кокет\", \"кокон\", \"кокос\", \"конка\", \"конто\", \"контора\", \"конторка\", \"контра\", \"коран\", \"коран\", \"корка\", \"корн\", \"корнер\", \"корона\", \"коронер\", \"коронка\", \"короста\", \"корс\", \"корсак\", \"корсар\", \"корсет\", \"корсетка\", \"корт\", \"корыст\", \"корыто\", \"косач\", \"косенка\", \"косточ\", \"костык\", \"косынка\", \"кото\", \"котон\", \"кочан\", \"кочет\", \"кран\", \"краск\", \"крат\", \"кратер\", \"крен\", \"крест\", \"кретон\", \"крокет\", \"кросно\", \"крот\", \"кротон\", \"крынка\", \"крыса\", \"крысенка\", \"накос\", \"наос\", \"наотр\", \"нарост\", \"наскор\", \"наст\", \"натр\", \"некот\", \"нектар\", \"нерка\", \"неро\", \"нора\", \"носач\", \"носочек\", \"нота\", \"нотка\", \"нотр\", \"окат\", \"океан\", \"окно\", \"окорка\", \"окот\", \"окрас\", \"октан\", \"онер\", \"оратор\", \"оркестр\", \"ороч\", \"осек\", \"осечка\", \"оскор\", \"осока\", \"осот\", \"отеска\", \"откос\", \"относ\", \"относка\", \"отроек\", \"отсек\", \"отсечка\", \"отчас\", \"отыск\", \"очерк\", \"очерта\", \"оческа\", \"очко\", \"рант\", \"ранчо\", \"раск\", \"раст\", \"растер\", \"реактор\", \"река\", \"ректон\", \"ректор\", \"рено\", \"рента\", \"реотан\", \"ресконтро\", \"ресто\", \"ресторан\", \"речка\", \"речонка\", \"рокер\", \"рокот\", \"роса\", \"рост\", \"росчерк\", \"рота\", \"ротон\", \"ротор\", \"рысак\", \"рысенка\", \"рыск\", \"секатор\", \"секта\", \"сектор\", \"сенат\", \"сенатор\", \"сент\", \"сент\", \"серко\", \"сетка\", \"сеча\", \"сечка\", \"скак\", \"скан\", \"сканер\", \"скарн\", \"скач\", \"скетч\", \"сконто\", \"скотч\", \"сныч\", \"сонар\", \"сонет\", \"сонетка\", \"сорорат\", \"сорт\", \"соте\", \"сотенка\", \"сотерн\", \"сотка\", \"сотр\", \"стакер\", \"стан\", \"станочек\", \"стенка\", \"стер\", \"стоечка\", \"стокер\", \"стон\", \"сторно\", \"сторона\", \"сторонка\", \"стрекач\", \"строка\", \"стык\", \"стычка\", \"сыночек\", \"сырт\", \"таксон\", \"такыр\", \"танк\", \"танкер\", \"таск\", \"текс\", \"теор\", \"тесак\", \"теска\", \"течка\", \"ткач\", \"тонер\", \"тонкос\", \"торакс\", \"тореро\", \"торон\", \"торос\", \"торс\", \"трак\", \"трас\", \"трек\", \"трен\", \"треск\", \"троечка\", \"трон\", \"трос\", \"трынка\", \"тысчонка\", \"чартер\", \"черкас\", \"черта\", \"ческа\", \"чесотка\", \"често\", \"чета\", \"чек\", \"ор\", \"тон\", \"рот\", \"ток\", \"сор\", \"транс\", \"оса\", \"срок\"]', '*Краткосрочные обязательства — это задолженность, срок погашения которой не превышает одного года.*', '2025-05-22 13:08:43', '2025-05-22 13:08:43'),
(14, 'РЕНТАБЕЛЬНОСТЬ', '[\"абонент\", \"аборт\", \"абсент\", \"алость\", \"анетол\", \"анонс\", \"анто\", \"антресоль\", \"нос\", \"сон\", \"арест\", \"аресто\", \"арно\", \"артель\", \"артос\", \"ателье\", \"атлет\", \"балет\", \"баннер\", \"бант\", \"барель\", \"барн\", \"барон\", \"баронет\", \"барс\", \"басон\", \"бастр\", \"батон\", \"батор\", \"бель\", \"бентос\", \"берест\", \"берет\", \"бертье\", \"бест\", \"бетатрон\", \"бетель\", \"бетон\", \"блат\", \"блесна\", \"блон\", \"болт\", \"боль\", \"борат\", \"борн\", \"борт\", \"борть\", \"брань\", \"брас\", \"браслет\", \"брат\", \"братьс\", \"бренность\", \"бретель\", \"брос\", \"енерал\", \"енол\", \"енот\", \"ерал\", \"ересь\", \"лансье\", \"ларь\", \"ласенер\", \"ласт\", \"леер\", \"леность\", \"лента\", \"лесть\", \"летет\", \"лобан\", \"лорнет\", \"лось\", \"наберет\", \"набор\", \"набр\", \"наброс\", \"нанос\", \"наос\", \"наотр\", \"нарост\", \"наст\", \"настень\", \"натр\", \"натрет\", \"натрон\", \"небо\", \"неболь\", \"небр\", \"ненастье\", \"неон\", \"нерал\", \"нерест\", \"неро\", \"нерол\", \"нетель\", \"ноль\", \"нона\", \"нонет\", \"нора\", \"носарь\", \"нота\", \"нотабль\", \"нотр\", \"оберет\", \"обет\", \"область\", \"обрат\", \"обретет\", \"обсе\", \"обстрел\", \"олеат\", \"олень\", \"ольстер\", \"онер\", \"орлан\", \"осень\", \"осталь\", \"остат\", \"ость\", \"отберет\", \"отель\", \"отрасль\", \"отребье\", \"отрет\", \"отстрел\", \"оттер\", \"рало\", \"рант\", \"рантье\", \"раст\", \"рать\", \"реал\", \"реальность\", \"реле\", \"рель\", \"рельс\", \"рено\", \"ренонс\", \"рента\", \"ренье\", \"ренье\", \"реостат\", \"реотан\", \"ресто\", \"роба\", \"роса\", \"рост\", \"рота\", \"сабо\", \"сало\", \"салон\", \"сальто\", \"сбор\", \"сель\", \"сенат\", \"сенатор\", \"сент\", \"сент\", \"сеньорат\", \"сераль\", \"серб\", \"сетбол\", \"сеттер\", \"сеть\", \"слон\", \"слот\", \"сноб\", \"соберет\", \"собр\", \"собрат\", \"сонант\", \"сонар\", \"сонет\", \"сорбент\", \"сорт\", \"соте\", \"сотерн\", \"сотр\", \"сотрет\", \"сталебетон\", \"сталь\", \"стан\", \"старт\", \"статор\", \"стебель\", \"стебло\", \"стела\", \"стентор\", \"стер\", \"стереобат\", \"стернь\", \"стлань\", \"стол\", \"столб\", \"столет\", \"стон\", \"стратон\", \"стрела\", \"стрельба\", \"строб\", \"табес\", \"табл\", \"табло\", \"табор\", \"талент\", \"талер\", \"талес\", \"талон\", \"таль\", \"танто\", \"тать\", \"театр\", \"тело\", \"тент\", \"теньер\", \"теор\", \"теорба\", \"тесло\", \"тестер\", \"тесто\", \"тесть\", \"тлен\", \"тленность\", \"тонер\", \"тоннель\", \"торба\", \"торбан\", \"торбас\", \"торс\", \"торт\", \"тост\", \"тостер\", \"трал\", \"трантель\", \"трас\", \"траст\", \"треба\", \"трен\", \"тренто\", \"трест\", \"трет\", \"треть\", \"трон\", \"трос\", \"трость\", \"трот\", \"ор\", \"тон\", \"рот\", \"сор\", \"лот\", \"транс\", \"оса\", \"бра\", \"бор\", \"тонна\", \"ель\", \"таро\", \"лань\", \"сота\"]', '*Рентабельность — это финансовый показатель, который отражает, сколько прибыли или убытков приносит каждый вложенный ресурс: деньги, оборудование, персонал, капитал, активы.*', '2025-05-22 13:10:06', '2025-05-22 13:10:06');

-- --------------------------------------------------------

--
-- Структура таблицы `card_word_specializations`
--

CREATE TABLE `card_word_specializations` (
  `card_word_id` bigint UNSIGNED NOT NULL,
  `specialization_id` bigint UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `card_word_specializations`
--

INSERT INTO `card_word_specializations` (`card_word_id`, `specialization_id`) VALUES
(1, 1),
(2, 1),
(3, 1),
(4, 1),
(5, 1),
(6, 1),
(7, 1),
(8, 1),
(9, 1),
(10, 1),
(11, 1),
(12, 1),
(13, 1),
(14, 1);

-- --------------------------------------------------------

--
-- Структура таблицы `failed_jobs`
--

CREATE TABLE `failed_jobs` (
  `id` bigint UNSIGNED NOT NULL,
  `uuid` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `connection` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `queue` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `payload` longtext COLLATE utf8mb4_unicode_ci NOT NULL,
  `exception` longtext COLLATE utf8mb4_unicode_ci NOT NULL,
  `failed_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `jobs`
--

CREATE TABLE `jobs` (
  `id` bigint UNSIGNED NOT NULL,
  `queue` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `payload` longtext COLLATE utf8mb4_unicode_ci NOT NULL,
  `attempts` tinyint UNSIGNED NOT NULL,
  `reserved_at` int UNSIGNED DEFAULT NULL,
  `available_at` int UNSIGNED NOT NULL,
  `created_at` int UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `job_batches`
--

CREATE TABLE `job_batches` (
  `id` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `total_jobs` int NOT NULL,
  `pending_jobs` int NOT NULL,
  `failed_jobs` int NOT NULL,
  `failed_job_ids` longtext COLLATE utf8mb4_unicode_ci NOT NULL,
  `options` mediumtext COLLATE utf8mb4_unicode_ci,
  `cancelled_at` int DEFAULT NULL,
  `created_at` int NOT NULL,
  `finished_at` int DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `migrations`
--

CREATE TABLE `migrations` (
  `id` int UNSIGNED NOT NULL,
  `migration` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `batch` int NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `migrations`
--

INSERT INTO `migrations` (`id`, `migration`, `batch`) VALUES
(1, '0001_01_01_000000_create_users_table', 1),
(2, '0001_01_01_000001_create_cache_table', 1),
(3, '0001_01_01_000002_create_jobs_table', 1),
(4, '2025_04_18_082654_create_specializations_table', 1),
(5, '2025_04_23_102056_create_card_luckies_table', 1),
(6, '2025_04_23_102104_create_card_actions_table', 1),
(7, '2025_04_23_102112_create_card_t_f_s_table', 1),
(8, '2025_04_23_102118_create_card_questions_table', 1),
(9, '2025_04_23_102130_create_card_decides_table', 1),
(10, '2025_04_23_102136_create_card_words_table', 1),
(11, '2025_04_23_102144_create_card_founds_table', 1),
(12, '2025_04_23_103959_create_card_action_specializations_table', 1),
(13, '2025_04_23_104008_create_card_lucky_specializations_table', 1),
(14, '2025_04_23_104017_create_card_decide_specializations_table', 1),
(15, '2025_04_23_104023_create_card_word_specializations_table', 1),
(16, '2025_04_23_104030_create_card_found_specializations_table', 1),
(17, '2025_04_23_104037_create_card_t_f_specializations_table', 1),
(18, '2025_04_23_104051_create_card_question_specializations_table', 1),
(19, '2025_04_30_082425_add_admin_code_to_users_table', 1),
(20, '2025_06_05_080449_remove_specialization_id_from_card_actions', 2);

-- --------------------------------------------------------

--
-- Структура таблицы `password_reset_tokens`
--

CREATE TABLE `password_reset_tokens` (
  `email` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `token` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `sessions`
--

CREATE TABLE `sessions` (
  `id` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `user_id` bigint UNSIGNED DEFAULT NULL,
  `ip_address` varchar(45) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `user_agent` text COLLATE utf8mb4_unicode_ci,
  `payload` longtext COLLATE utf8mb4_unicode_ci NOT NULL,
  `last_activity` int NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `sessions`
--

INSERT INTO `sessions` (`id`, `user_id`, `ip_address`, `user_agent`, `payload`, `last_activity`) VALUES
('2jjdT8zKCBCtqj9HUsCo83c20bYTDJ4Ak4tn20ju', NULL, '31.184.199.89', 'Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/44.0.2403.157 Safari/537.36', 'YTozOntzOjY6Il90b2tlbiI7czo0MDoiOHZpUFBMVlZWT09oMWtkWDRWZHhZWEk5Rk12ZnBuOU56WWFGSG9aRiI7czo5OiJfcHJldmlvdXMiO2E6MTp7czozOiJ1cmwiO3M6MjI6Imh0dHBzOi8vaGV4LmI0cnNub3YucnUiO31zOjY6Il9mbGFzaCI7YToyOntzOjM6Im9sZCI7YTowOnt9czozOiJuZXciO2E6MDp7fX19', 1785174121),
('3IPtWzmyJxSl2YXLlQIEXhvxBanIN0eb0US1IGVU', NULL, '31.184.199.89', 'Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/44.0.2403.157 Safari/537.36', 'YTozOntzOjY6Il90b2tlbiI7czo0MDoieGNVeTE1UUhxdVFVOVpNQ2RGVGw4VmtVNWFwNDE0b2tuZDdKOUhIayI7czo5OiJfcHJldmlvdXMiO2E6MTp7czozOiJ1cmwiO3M6MjI6Imh0dHBzOi8vaGV4LmI0cnNub3YucnUiO31zOjY6Il9mbGFzaCI7YToyOntzOjM6Im9sZCI7YTowOnt9czozOiJuZXciO2E6MDp7fX19', 1785168841),
('EcHtBtBWinCL0tMZ9aRnnkEr1oxxga1UW1yvbphB', NULL, '31.184.199.89', 'Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/44.0.2403.157 Safari/537.36', 'YTozOntzOjY6Il90b2tlbiI7czo0MDoiUWNMeWdYSmFxbEhiSmVwd2NrdUp1MzJjRTRSNlVWdVRSWkRyZjh4SyI7czo5OiJfcHJldmlvdXMiO2E6MTp7czozOiJ1cmwiO3M6MjI6Imh0dHBzOi8vaGV4LmI0cnNub3YucnUiO31zOjY6Il9mbGFzaCI7YToyOntzOjM6Im9sZCI7YTowOnt9czozOiJuZXciO2E6MDp7fX19', 1785172441),
('Fkos49fwY6IdEFzjaHoZpGP3Y8dPUE2ieGHTikRl', NULL, '31.184.199.89', 'Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/44.0.2403.157 Safari/537.36', 'YTozOntzOjY6Il90b2tlbiI7czo0MDoiblBhbTRLWDRuTE40a3lacUt0Mm5NaE51VTQ4ZUJXQmp5RGxsYUQwSiI7czo5OiJfcHJldmlvdXMiO2E6MTp7czozOiJ1cmwiO3M6MjI6Imh0dHBzOi8vaGV4LmI0cnNub3YucnUiO31zOjY6Il9mbGFzaCI7YToyOntzOjM6Im9sZCI7YTowOnt9czozOiJuZXciO2E6MDp7fX19', 1785173281),
('jgtgN6rWpy9YWvwNccXfHM1jvpEH8snvjQFNWD09', NULL, '31.184.199.89', 'Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/44.0.2403.157 Safari/537.36', 'YTozOntzOjY6Il90b2tlbiI7czo0MDoibWZ4ZVBmejVpRE9meVhVNnlSSGZybFZLVWpyeUFuTENyaVdXNHNQViI7czo5OiJfcHJldmlvdXMiO2E6MTp7czozOiJ1cmwiO3M6MjI6Imh0dHBzOi8vaGV4LmI0cnNub3YucnUiO31zOjY6Il9mbGFzaCI7YToyOntzOjM6Im9sZCI7YTowOnt9czozOiJuZXciO2E6MDp7fX19', 1785171361),
('jyd72nCnNBUIAkZmsDZ07r9E8inmpgyDXRSuMgHn', NULL, '31.184.199.89', 'Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/44.0.2403.157 Safari/537.36', 'YTozOntzOjY6Il90b2tlbiI7czo0MDoiWUNJMjBIUWs0QkR6ZTBrdmJiaFl3eGxMeTlzcWxMa3d0M0VlN1JTMSI7czo5OiJfcHJldmlvdXMiO2E6MTp7czozOiJ1cmwiO3M6MjI6Imh0dHBzOi8vaGV4LmI0cnNub3YucnUiO31zOjY6Il9mbGFzaCI7YToyOntzOjM6Im9sZCI7YTowOnt9czozOiJuZXciO2E6MDp7fX19', 1785175201),
('o4Af7A372yLkA9a3gzEf1aYDYibEGgD7vQNtbQJi', NULL, '31.184.199.89', 'Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/44.0.2403.157 Safari/537.36', 'YTozOntzOjY6Il90b2tlbiI7czo0MDoicVBUZ0h5eEF6Q0ZqMnpKWFVmdXk1RkxSZ2psdkdxRGJDdGdIanQ2SCI7czo5OiJfcHJldmlvdXMiO2E6MTp7czozOiJ1cmwiO3M6MjI6Imh0dHBzOi8vaGV4LmI0cnNub3YucnUiO31zOjY6Il9mbGFzaCI7YToyOntzOjM6Im9sZCI7YTowOnt9czozOiJuZXciO2E6MDp7fX19', 1785174961),
('q4WrRNNAp7G3A9EMgncH9tPGrhXla76Qk0MVqZEJ', NULL, '31.184.199.89', 'Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/44.0.2403.157 Safari/537.36', 'YTozOntzOjY6Il90b2tlbiI7czo0MDoiaUVGbUxJcG5IaTJaR2RRY3hSc1g0cndWWk1naGd1Y0dPN2s4dDNxOSI7czo5OiJfcHJldmlvdXMiO2E6MTp7czozOiJ1cmwiO3M6MjI6Imh0dHBzOi8vaGV4LmI0cnNub3YucnUiO31zOjY6Il9mbGFzaCI7YToyOntzOjM6Im9sZCI7YTowOnt9czozOiJuZXciO2E6MDp7fX19', 1785168001),
('RZgL1lsIvEJlh77IFLMGxuYRzR1BqLwDx93s4DcA', NULL, '31.184.199.89', 'Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/44.0.2403.157 Safari/537.36', 'YTozOntzOjY6Il90b2tlbiI7czo0MDoiYjA2UGtybTk2ZzdpOHBVcFo3b0RmdUt2bTdvM2R0NXpVenZpV1lqaSI7czo5OiJfcHJldmlvdXMiO2E6MTp7czozOiJ1cmwiO3M6MjI6Imh0dHBzOi8vaGV4LmI0cnNub3YucnUiO31zOjY6Il9mbGFzaCI7YToyOntzOjM6Im9sZCI7YTowOnt9czozOiJuZXciO2E6MDp7fX19', 1785171601),
('SEgwwlUXQAqP4iBqCTblEAQWZmbCc9y7AXyMf88F', NULL, '94.154.43.229', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/147.0.0.0 Safari/537.36', 'YTozOntzOjY6Il90b2tlbiI7czo0MDoiVFpHdURLZjBxS1lhQ1NuT1VBRXVGMHZyaHhwRHFNRkQ3MDBFNkZ1YyI7czo5OiJfcHJldmlvdXMiO2E6MTp7czozOiJ1cmwiO3M6MjI6Imh0dHBzOi8vaGV4LmI0cnNub3YucnUiO31zOjY6Il9mbGFzaCI7YToyOntzOjM6Im9sZCI7YTowOnt9czozOiJuZXciO2E6MDp7fX19', 1785172370),
('tj7Y1lRqZjsySvM4SiRnEtquuN5U9PYRAwzcGJNk', NULL, '31.184.199.89', 'Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/44.0.2403.157 Safari/537.36', 'YTozOntzOjY6Il90b2tlbiI7czo0MDoiQnZQb05ydGpXZDN5Q215aU5rc1JPeWZpWTE0b3dmVmNaeXBoTVlIMSI7czo5OiJfcHJldmlvdXMiO2E6MTp7czozOiJ1cmwiO3M6MjI6Imh0dHBzOi8vaGV4LmI0cnNub3YucnUiO31zOjY6Il9mbGFzaCI7YToyOntzOjM6Im9sZCI7YTowOnt9czozOiJuZXciO2E6MDp7fX19', 1785169681),
('TsOJmIw3xlR5uYdTQT4ytAxKiv9Fw0V5QRwQnCcX', NULL, '31.184.199.89', 'Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/44.0.2403.157 Safari/537.36', 'YTozOntzOjY6Il90b2tlbiI7czo0MDoiQXhEc1JzeTRjeUhiR0JOd3I5UmFtQ3JuRm1FSWtWZjFUOE9rWkh4YiI7czo5OiJfcHJldmlvdXMiO2E6MTp7czozOiJ1cmwiO3M6MjI6Imh0dHBzOi8vaGV4LmI0cnNub3YucnUiO31zOjY6Il9mbGFzaCI7YToyOntzOjM6Im9sZCI7YTowOnt9czozOiJuZXciO2E6MDp7fX19', 1785170521);

-- --------------------------------------------------------

--
-- Структура таблицы `specializations`
--

CREATE TABLE `specializations` (
  `id` bigint UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `method` int NOT NULL DEFAULT '0',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `specializations`
--

INSERT INTO `specializations` (`id`, `name`, `method`, `created_at`, `updated_at`) VALUES
(1, 'Экономика и бухгалтерский учёт', 0, '2025-05-22 10:28:49', '2025-05-22 10:28:49'),
(2, 'Веб-разработчик и мультимедийных приложений', 1, '2025-06-09 08:02:34', '2025-06-09 08:02:34'),
(3, 'Тестовая специальность', 0, '2025-07-04 14:07:05', '2025-07-04 14:07:05');

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE `users` (
  `id` bigint UNSIGNED NOT NULL,
  `login` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `admin_code` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `role` int NOT NULL DEFAULT '2',
  `password` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `remember_token` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`id`, `login`, `admin_code`, `name`, `role`, `password`, `remember_token`, `created_at`, `updated_at`) VALUES
(1, 'Admin', '$2y$12$U5sUhG9SriimDhHe73ZLpOVKANSGd6.frKmTSzI6GN1qsYXT6.IPO', NULL, 1, '$2y$12$yv8ZBz.vWRBNdW1EgZB87eIjIOfBPREaWVX1JFmXHAj8bANDKnpm6', NULL, '2025-05-22 10:27:21', '2026-07-22 20:11:09');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `cache`
--
ALTER TABLE `cache`
  ADD PRIMARY KEY (`key`);

--
-- Индексы таблицы `cache_locks`
--
ALTER TABLE `cache_locks`
  ADD PRIMARY KEY (`key`);

--
-- Индексы таблицы `card_actions`
--
ALTER TABLE `card_actions`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `card_action_specializations`
--
ALTER TABLE `card_action_specializations`
  ADD PRIMARY KEY (`card_action_id`,`specialization_id`),
  ADD KEY `card_action_specializations_specialization_id_foreign` (`specialization_id`);

--
-- Индексы таблицы `card_decides`
--
ALTER TABLE `card_decides`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `card_decide_specializations`
--
ALTER TABLE `card_decide_specializations`
  ADD PRIMARY KEY (`card_decide_id`,`specialization_id`),
  ADD KEY `card_decide_specializations_specialization_id_foreign` (`specialization_id`);

--
-- Индексы таблицы `card_founds`
--
ALTER TABLE `card_founds`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `card_found_specializations`
--
ALTER TABLE `card_found_specializations`
  ADD PRIMARY KEY (`card_found_id`,`specialization_id`),
  ADD KEY `card_found_specializations_specialization_id_foreign` (`specialization_id`);

--
-- Индексы таблицы `card_luckies`
--
ALTER TABLE `card_luckies`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `card_luckies_points_unique` (`points`);

--
-- Индексы таблицы `card_lucky_specializations`
--
ALTER TABLE `card_lucky_specializations`
  ADD PRIMARY KEY (`card_lucky_id`,`specialization_id`),
  ADD KEY `card_lucky_specializations_specialization_id_foreign` (`specialization_id`);

--
-- Индексы таблицы `card_questions`
--
ALTER TABLE `card_questions`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `card_question_specializations`
--
ALTER TABLE `card_question_specializations`
  ADD PRIMARY KEY (`card_question_id`,`specialization_id`),
  ADD KEY `card_question_specializations_specialization_id_foreign` (`specialization_id`);

--
-- Индексы таблицы `card_t_f_s`
--
ALTER TABLE `card_t_f_s`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `card_t_f_specializations`
--
ALTER TABLE `card_t_f_specializations`
  ADD PRIMARY KEY (`card_t_f_id`,`specialization_id`),
  ADD KEY `card_t_f_specializations_specialization_id_foreign` (`specialization_id`);

--
-- Индексы таблицы `card_words`
--
ALTER TABLE `card_words`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `card_word_specializations`
--
ALTER TABLE `card_word_specializations`
  ADD PRIMARY KEY (`card_word_id`,`specialization_id`),
  ADD KEY `card_word_specializations_specialization_id_foreign` (`specialization_id`);

--
-- Индексы таблицы `failed_jobs`
--
ALTER TABLE `failed_jobs`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `failed_jobs_uuid_unique` (`uuid`);

--
-- Индексы таблицы `jobs`
--
ALTER TABLE `jobs`
  ADD PRIMARY KEY (`id`),
  ADD KEY `jobs_queue_index` (`queue`);

--
-- Индексы таблицы `job_batches`
--
ALTER TABLE `job_batches`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `migrations`
--
ALTER TABLE `migrations`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `password_reset_tokens`
--
ALTER TABLE `password_reset_tokens`
  ADD PRIMARY KEY (`email`);

--
-- Индексы таблицы `sessions`
--
ALTER TABLE `sessions`
  ADD PRIMARY KEY (`id`),
  ADD KEY `sessions_user_id_index` (`user_id`),
  ADD KEY `sessions_last_activity_index` (`last_activity`);

--
-- Индексы таблицы `specializations`
--
ALTER TABLE `specializations`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `card_actions`
--
ALTER TABLE `card_actions`
  MODIFY `id` bigint UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=22;

--
-- AUTO_INCREMENT для таблицы `card_decides`
--
ALTER TABLE `card_decides`
  MODIFY `id` bigint UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=14;

--
-- AUTO_INCREMENT для таблицы `card_founds`
--
ALTER TABLE `card_founds`
  MODIFY `id` bigint UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=21;

--
-- AUTO_INCREMENT для таблицы `card_luckies`
--
ALTER TABLE `card_luckies`
  MODIFY `id` bigint UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT для таблицы `card_questions`
--
ALTER TABLE `card_questions`
  MODIFY `id` bigint UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=34;

--
-- AUTO_INCREMENT для таблицы `card_t_f_s`
--
ALTER TABLE `card_t_f_s`
  MODIFY `id` bigint UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=21;

--
-- AUTO_INCREMENT для таблицы `card_words`
--
ALTER TABLE `card_words`
  MODIFY `id` bigint UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=15;

--
-- AUTO_INCREMENT для таблицы `failed_jobs`
--
ALTER TABLE `failed_jobs`
  MODIFY `id` bigint UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `jobs`
--
ALTER TABLE `jobs`
  MODIFY `id` bigint UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `migrations`
--
ALTER TABLE `migrations`
  MODIFY `id` int UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=21;

--
-- AUTO_INCREMENT для таблицы `specializations`
--
ALTER TABLE `specializations`
  MODIFY `id` bigint UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT для таблицы `users`
--
ALTER TABLE `users`
  MODIFY `id` bigint UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- Ограничения внешнего ключа сохраненных таблиц
--

--
-- Ограничения внешнего ключа таблицы `card_action_specializations`
--
ALTER TABLE `card_action_specializations`
  ADD CONSTRAINT `card_action_specializations_card_action_id_foreign` FOREIGN KEY (`card_action_id`) REFERENCES `card_actions` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `card_action_specializations_specialization_id_foreign` FOREIGN KEY (`specialization_id`) REFERENCES `specializations` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Ограничения внешнего ключа таблицы `card_decide_specializations`
--
ALTER TABLE `card_decide_specializations`
  ADD CONSTRAINT `card_decide_specializations_card_decide_id_foreign` FOREIGN KEY (`card_decide_id`) REFERENCES `card_decides` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `card_decide_specializations_specialization_id_foreign` FOREIGN KEY (`specialization_id`) REFERENCES `specializations` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Ограничения внешнего ключа таблицы `card_found_specializations`
--
ALTER TABLE `card_found_specializations`
  ADD CONSTRAINT `card_found_specializations_card_found_id_foreign` FOREIGN KEY (`card_found_id`) REFERENCES `card_founds` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `card_found_specializations_specialization_id_foreign` FOREIGN KEY (`specialization_id`) REFERENCES `specializations` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Ограничения внешнего ключа таблицы `card_lucky_specializations`
--
ALTER TABLE `card_lucky_specializations`
  ADD CONSTRAINT `card_lucky_specializations_card_lucky_id_foreign` FOREIGN KEY (`card_lucky_id`) REFERENCES `card_luckies` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `card_lucky_specializations_specialization_id_foreign` FOREIGN KEY (`specialization_id`) REFERENCES `specializations` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Ограничения внешнего ключа таблицы `card_question_specializations`
--
ALTER TABLE `card_question_specializations`
  ADD CONSTRAINT `card_question_specializations_card_question_id_foreign` FOREIGN KEY (`card_question_id`) REFERENCES `card_questions` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `card_question_specializations_specialization_id_foreign` FOREIGN KEY (`specialization_id`) REFERENCES `specializations` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Ограничения внешнего ключа таблицы `card_t_f_specializations`
--
ALTER TABLE `card_t_f_specializations`
  ADD CONSTRAINT `card_t_f_specializations_card_t_f_id_foreign` FOREIGN KEY (`card_t_f_id`) REFERENCES `card_t_f_s` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `card_t_f_specializations_specialization_id_foreign` FOREIGN KEY (`specialization_id`) REFERENCES `specializations` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Ограничения внешнего ключа таблицы `card_word_specializations`
--
ALTER TABLE `card_word_specializations`
  ADD CONSTRAINT `card_word_specializations_card_word_id_foreign` FOREIGN KEY (`card_word_id`) REFERENCES `card_words` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `card_word_specializations_specialization_id_foreign` FOREIGN KEY (`specialization_id`) REFERENCES `specializations` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
